const newsData = {
  main_news: [
    {
      id: 1,
      slug: "ap-101",
      category: "ap",
      headline: " జగన్ కనుసైగ చేస్తే చాలు..",
      img_url:
        "https://tmedia.net.in/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-09-at-9.21.34-PM.jpeg",
      subjectsList: [
        "వైఎస్సార్‌సీపీ (YSRCP)కి వ్యతిరేకంగా ఎలాంటి పొత్తులు పెట్టుకున్నా ఫర్వాలేదని.. పార్టీ యువతంతా సీఎం జగన్‌కు ప్రైవేట్ సైన్యంగా పనిచేస్తామన్నారు పార్టీ యువజన విభాగం రాష్ట్ర అధ్యక్షుడు, శాప్ ఛైర్మన్ బైరెడ్డి సిద్ధార్థరెడ్డి (Byreddy Siddharth Reddy). ",
        `రాజమండ్రిలో జక్కంపూడి గణేష్ ఆధ్వర్యంలో మెగా స్పోర్ట్స్ ఫెస్టివల్ ప్రారంభోత్సవంలో ఈ వ్యాఖ్యలు చేశారు. "ముఖ్యమంత్రి జగన్ మావాడు' అని ప్రజలు ఆయన్ను గుండెల్లో పెట్టుకున్నారని బైరెడ్డి అన్నారు. జక్కంపూడి కుటుంబం అంటే తమ సొంత కుటుంబం అనే భావన జిల్లా ప్రజల్లో ఉందన్నారు. పార్టీ యువజన విభాగం సీఎం జగన్‌కు రక్షణ వలయంలా పనిచేస్తుందన్నారు.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 1,
      slug: "ap-101",
      category: "ap",
      headline: " జగన్ కనుసైగ చేస్తే చాలు..",
      img_url:
        "https://tmedia.net.in/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-09-at-9.21.34-PM.jpeg",
      subjectsList: [
        "వైఎస్సార్‌సీపీ (YSRCP)కి వ్యతిరేకంగా ఎలాంటి పొత్తులు పెట్టుకున్నా ఫర్వాలేదని.. పార్టీ యువతంతా సీఎం జగన్‌కు ప్రైవేట్ సైన్యంగా పనిచేస్తామన్నారు పార్టీ యువజన విభాగం రాష్ట్ర అధ్యక్షుడు, శాప్ ఛైర్మన్ బైరెడ్డి సిద్ధార్థరెడ్డి (Byreddy Siddharth Reddy). ",
        `రాజమండ్రిలో జక్కంపూడి గణేష్ ఆధ్వర్యంలో మెగా స్పోర్ట్స్ ఫెస్టివల్ ప్రారంభోత్సవంలో ఈ వ్యాఖ్యలు చేశారు. "ముఖ్యమంత్రి జగన్ మావాడు' అని ప్రజలు ఆయన్ను గుండెల్లో పెట్టుకున్నారని బైరెడ్డి అన్నారు. జక్కంపూడి కుటుంబం అంటే తమ సొంత కుటుంబం అనే భావన జిల్లా ప్రజల్లో ఉందన్నారు. పార్టీ యువజన విభాగం సీఎం జగన్‌కు రక్షణ వలయంలా పనిచేస్తుందన్నారు.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 1,
      slug: "ap-101",
      category: "ap",
      headline: " జగన్ కనుసైగ చేస్తే చాలు..",
      img_url:
        "https://tmedia.net.in/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-09-at-9.21.34-PM.jpeg",
      subjectsList: [
        "వైఎస్సార్‌సీపీ (YSRCP)కి వ్యతిరేకంగా ఎలాంటి పొత్తులు పెట్టుకున్నా ఫర్వాలేదని.. పార్టీ యువతంతా సీఎం జగన్‌కు ప్రైవేట్ సైన్యంగా పనిచేస్తామన్నారు పార్టీ యువజన విభాగం రాష్ట్ర అధ్యక్షుడు, శాప్ ఛైర్మన్ బైరెడ్డి సిద్ధార్థరెడ్డి (Byreddy Siddharth Reddy). ",
        `రాజమండ్రిలో జక్కంపూడి గణేష్ ఆధ్వర్యంలో మెగా స్పోర్ట్స్ ఫెస్టివల్ ప్రారంభోత్సవంలో ఈ వ్యాఖ్యలు చేశారు. "ముఖ్యమంత్రి జగన్ మావాడు' అని ప్రజలు ఆయన్ను గుండెల్లో పెట్టుకున్నారని బైరెడ్డి అన్నారు. జక్కంపూడి కుటుంబం అంటే తమ సొంత కుటుంబం అనే భావన జిల్లా ప్రజల్లో ఉందన్నారు. పార్టీ యువజన విభాగం సీఎం జగన్‌కు రక్షణ వలయంలా పనిచేస్తుందన్నారు.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
  ],
  main_news_list: [
    {
      id: 1,
      slug: "ap-101",
      category: "ap",
      headline: " జగన్ కనుసైగ చేస్తే చాలు..",
      img_url:
        "https://tmedia.net.in/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-09-at-9.21.34-PM.jpeg",
      subjectsList: [
        "వైఎస్సార్‌సీపీ (YSRCP)కి వ్యతిరేకంగా ఎలాంటి పొత్తులు పెట్టుకున్నా ఫర్వాలేదని.. పార్టీ యువతంతా సీఎం జగన్‌కు ప్రైవేట్ సైన్యంగా పనిచేస్తామన్నారు పార్టీ యువజన విభాగం రాష్ట్ర అధ్యక్షుడు, శాప్ ఛైర్మన్ బైరెడ్డి సిద్ధార్థరెడ్డి (Byreddy Siddharth Reddy). ",
        `రాజమండ్రిలో జక్కంపూడి గణేష్ ఆధ్వర్యంలో మెగా స్పోర్ట్స్ ఫెస్టివల్ ప్రారంభోత్సవంలో ఈ వ్యాఖ్యలు చేశారు. "ముఖ్యమంత్రి జగన్ మావాడు' అని ప్రజలు ఆయన్ను గుండెల్లో పెట్టుకున్నారని బైరెడ్డి అన్నారు. జక్కంపూడి కుటుంబం అంటే తమ సొంత కుటుంబం అనే భావన జిల్లా ప్రజల్లో ఉందన్నారు. పార్టీ యువజన విభాగం సీఎం జగన్‌కు రక్షణ వలయంలా పనిచేస్తుందన్నారు.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 2,
      slug: "ap-102",
      headline: "పులివెందులలో వైసీపీ కంటే టీడీపీకి ఎక్కువ ఓట్లు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98746813/98746813.jpg?imgsize=39548&width=540&height=405&resizemode=75",
      subjectsList: [
        "ఏపీ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల ఫలితాల్లో టీడీపీ రెండు స్థానాల్లో విజయం సాధించింది. తూర్పు రాయలసీమ స్థానం నుంచి కంచర్ల శ్రీకాంత్.. ఉత్తరాంధ్ర స్థానం నుంచి వేపాడ చిరంజీవిరావు గెలిచారు. ఇక మిగిలిన పశ్చిమ రాయలసీమ స్థానంలో హోరా హోరీగా కౌంటింగ్ సాగుతుండగా.. రెండో ప్రాధాన్యతా ఓట్ల లెక్కింపు జరుగుతోంది. దీంతో అందరి కళ్లు ఆ ఫలితం వైపు మళ్లింది.",
        `ఈ క్రమంలో పశ్చిమ రాయలసీమ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికలకు సంబంధించి ఓ ప్రచారం ఇప్పుడు వైరల్ అవుతోంది. ముఖ్యమంత్రి వైఎస్ జగన్ ప్రాతినిధ్యం వహిస్తున్న పులివెందుల నియోజకవర్గంలో అధికార వైఎస్సార్‌సీపీ అభ్యర్థి కంటే టీడీపీ అభ్యర్థికి ఎక్కువ ఓట్లు వచ్చాయని ప్రచారం జరుగుతోంది. `,
        `సోషల్ మీడియాలో పోస్టులు, ట్వీట్‌లు వైరల్ అవుతున్నాయి.. దీంతో ఏపీ ప్రభుత్వ ఫ్యాక్ట్‌ చెక్‌ విభాగం స్పందించింది. ఆ ప్రచారం వాస్తవం కాదని క్లారిటీ ఇచ్చింది. సోషల్‌ మీడియాలో జరుగుతున్న ఈ వాదన పూర్తిగా నిరాధారమని తేల్చి చెప్పింది.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 3,
      slug: "ap-106",
      headline: "నారా లోకేష్ పాదయాత్రకు బ్రేక్..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98571327/98571327.jpg?imgsize=74252&width=700&height=525&resizemode=75",
      subjectsList: [
        "తెలుగు దేశం పార్టీ (టీడీపీ) జాతీయ ప్రధాన కార్యదర్శి నారా లోకేష్‌ పాదయాత్రకు ఎన్నికల సంఘం బ్రేక్ ఇచ్చింది. లోకేష్ రిక్వెస్ట్‌ను ఎన్నికల సంఘం తోసిపుచ్చింది. దీంతో పాదయాత్రకు లోకేష్ బ్రేక్‌ ఇచ్చి హైదరాబాద్‌కు బయల్దేరారు. సోమవారం రాష్ట్రంలో గ్రాడ్యుయేట్స్, టీచర్స్ ఎమ్మెల్సీ ఎన్నికలు జరగనున్న విషయం తెలిసిందే. అన్నమయ్య జిల్లాలో తన పాదయాత్ర కొనసాగుతున్న తరుణంలో.. తాను కంటేవారిపల్లి విడిది కేంద్రంలో ఉండేందుకు మినహాయింపు ఇవ్వాలని కేంద్ర ఎన్నికల సంఘాన్ని లోకేష్ కోరారు.",
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 4,
      slug: "ap-107",
      headline:
        "ఓట్లు చీలడానికి వీల్లేదు.. ఆ పార్టీకి కూడా ఓటెయ్యండి: చంద్రబాబు",
      img_url:
        "https://telugu.samayam.com/thumb/98567309/98567309.jpg?imgsize=50962&width=700&height=525&resizemode=75",
      subjectsList: [
        "రాష్ట్రంలో ప్రజా వ్యతిరేక పాలన సాగిస్తున్న వైఎస్సార్ కాంగ్రెస్ పార్టీకి ఈ ఎమ్మెల్సీ ఎన్నికల్లో బుద్ధి చెప్పాలని తెలుగుదేశం పార్టీ అధినేత చంద్రబాబునాయుడు అన్నారు. ఈ ఎన్నికల్లో టీడీపీ అభ్యర్థులను గెలిపించాలని కోరారు. ఎన్నికల్లో ప్రలోభాలు, బోగస్ ఓట్లతో వైసీపీ అక్రమాలకు పాల్పడుతోందని తీవ్ర ఆగ్రహం వ్యక్తం చేశారు.",
        "ఈ మేరకు రాష్ట్ర ప్రజలకు శనివారం చంద్రబాబునాయుడు బహిరంగ లేఖ రాశారు. జగన్ ప్రభుత్వం అధికారంలోకి వచ్చినప్పటి నుంచి హక్కులను కాలరాస్తూ తమను ఎలా మోసం చేసిందో ఉద్యోగులు, టీచర్లు గుర్తించి ఈ ఎన్నికల్లో బుద్ధి చెప్పాలన్నారు. పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల్లో టీడీపీ అభ్యర్థులు వేపాడ చిరంజీవిరావు, కంచర్ల శ్రీకాంత్‌, భూంరెడ్డి రామ్‌గోపాల్‌ రెడ్డిని గెలిపించాలని విజ్ఞప్తి చేశారు.",
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 5,
      slug: "tn-103",
      headline: "రేవంత్ రెడ్డి పాదయాత్రకు నన్ను పిలవలేదు..",
      category: "tn",
      img_url:
        "https://assets.thehansindia.com/h-upload/2020/08/27/994555-komati-reddy.webp",
      subjectsList: [
        "కాంగ్రెస్ సీనియర్ నాయకుడు, భువనగిరి ఎంపీ కోమటిరెడ్డి వెంకట్ రెడ్డి మరోసారి రేవంత్ రెడ్డిపై ఆసక్తికర వ్యాఖ్యలు చేశారు. రేవంత్ పాదయాత్రకు తనను పిలవలేదని ఆయన వెల్లడించారు. మార్చి 16 నుంచి సీఎల్పీ నాయకుడు మల్లు భట్టి విక్రమార్క పాదయాత్ర చేయబోతున్నారు. ఈ నేపథ్యంలో విక్రమార్కతో ఆదివారం హైదరాబాద్ లోని తన నివాసంలో ఆయన భేటీ అయ్యారు. ఈ సందర్భంగా కోమటిరెడ్డి మాట్లాడుతూ.. విక్రమార్క పాదయాత్రలో తాను కూడా పాల్గొనబోతున్నట్టు చెప్పారు.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 6,
      slug: "tn-104",
      headline:
        "TSPSC పేపర్ లీక్ కేసు: అనుమానితులను సిట్ ఆరు రోజుల కస్టడీకి తీసుకుంది",
      category: "tn",
      img_url:
        "https://education.sakshi.com/sites/default/files/inline-images/tspsc%20police%20news_1.jpg",
      subjectsList: [
        "హైదరాబాద్‌: తెలంగాణ రాష్ట్ర పబ్లిక్‌ సర్వీస్‌ కమిషన్‌ (టీఎస్‌పీఎస్‌సీ) ప్రశ్నపత్రం లీక్‌ కేసును విచారిస్తున్న ప్రత్యేక దర్యాప్తు బృందం (సిట్‌) తొమ్మిది మంది అనుమానితులను ఆరు రోజుల పోలీసు కస్టడీకి తీసుకుంది.",
        "ఈ కేసులో నిందితులను మరింతగా విచారించాల్సి ఉన్నందున, మరిన్ని వివరాలు రాబట్టాల్సి ఉన్నందున వారిని ఒక వారం కస్టడీకి ఇవ్వాలని సిట్ అధికారులు గతంలో స్థానిక కోర్టులో పిటిషన్ దాఖలు చేశారు. శుక్రవారం ఇరుపక్షాల వాదనలు విన్న న్యాయస్థానం శనివారం నుంచి వీరి కస్టడీకి అనుమతిస్తూ ఉత్తర్వులు జారీ చేసింది.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 7,
      slug: "tn-105",
      headline: "ఎట్టకేలకు తెలంగాణకు మెగా టెక్స్‌టైల్ పార్క్.",
      category: "tn",
      img_url:
        "https://media.andhrajyothy.com/media/2023/20230317/1textile_3801a704bb_V_jpg--799x414-4g.webp",
      subjectsList: [
        "హైదరాబాద్: రాష్ట్రంలో మెగా టెక్స్‌టైల్ పార్క్ ఏర్పాటు చేయాలన్న తెలంగాణ ప్రభుత్వ చిరకాల డిమాండ్‌ను బీజేపీ నేతృత్వంలోని కేంద్రం ఎట్టకేలకు పరిగణనలోకి తీసుకుంది.",
        `పీఎం మిత్ర (మెగా ఇంటిగ్రేటెడ్ టెక్స్‌టైల్ రీజియన్ అండ్ అపెరల్) కింద తమిళనాడు, తెలంగాణ, కర్ణాటక, మహారాష్ట్ర, గుజరాత్, మధ్యప్రదేశ్, ఉత్తరప్రదేశ్‌లలో మెగా టెక్స్‌టైల్ పార్క్ ఏర్పాటు చేయనున్నట్లు ప్రధాని నరేంద్ర మోదీ శుక్రవారం ప్రకటించారు. తమిళనాడు మరియు తెలంగాణ కోసం సేవ్ చేయండి, మిగిలిన ఐదు బిజెపి పాలిత రాష్ట్రాలలో ఈ పార్కులు ఏర్పాటు చేయబడుతున్నాయి.`,
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 8,
      slug: "tn-106",
      headline:
        "బండి సంజయ్‌కు వ్యతిరేకంగా కెటి రామారావు విస్తృత ప్రయోగాలు చేశారు",
      category: "tn",
      img_url:
        "https://image.telanganatoday.com/wp-content/uploads/2022/05/KTR-Bandi_V_jpg--816x480-4g.webp?sw=1920&dsz=816x480&iw=659&p=false&r=1",
      subjectsList: [
        "హైదరాబాద్: బిజెపి రాష్ట్ర అధ్యక్షుడు బండి సంజయ్‌ చేసిన వ్యాఖ్యలపై బిఆర్‌ఎస్‌ వర్కింగ్‌ ప్రెసిడెంట్‌, ఐటి శాఖ మంత్రి కెటి రామారావు తీవ్ర మినహాయింపునిస్తూ రాజ్యాంగ సంస్థలు, ప్రభుత్వ శాఖల పనితీరుపై అవగాహన లేకుండా రాజకీయ ప్రేరేపిత వ్యాఖ్యలు చేశారని ఆరోపించారు. రాబోయే రోజుల్లో సంజయ్‌ రాజకీయ కుట్రలకు పాల్పడి క్రిమినల్‌ కేసులు ఎదుర్కొనే అవకాశం ఉందని హెచ్చరించారు.",
        `శుక్రవారం ఇక్కడ ఒక వివరణాత్మక ప్రకటనలో, TSPSC సమస్యపై సంజయ్ లేవనెత్తిన అసంబద్ధమైన మరియు ప్రేరేపిత ఆరోపణలపై రామారావు స్పందించారు. TSPSC ఒక స్వతంత్ర సంస్థ మరియు TSPSC వ్యవహారాల్లో రాష్ట్ర ప్రభుత్వ ప్రమేయం పరిమితంగా ఉంది. అయితే కమిషన్‌పై బండి సంజయ్‌ చేసిన వ్యాఖ్యలు ఆయన అవగాహనా రాహిత్యాన్ని, అజ్ఞానాన్ని నిరూపిస్తున్నాయని అన్నారు`,
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 9,
      slug: "tn-103",
      headline: "రేవంత్ రెడ్డి పాదయాత్రకు నన్ను పిలవలేదు..",
      category: "tn",
      img_url:
        "https://assets.thehansindia.com/h-upload/2020/08/27/994555-komati-reddy.webp",
      subjectsList: [
        "కాంగ్రెస్ సీనియర్ నాయకుడు, భువనగిరి ఎంపీ కోమటిరెడ్డి వెంకట్ రెడ్డి మరోసారి రేవంత్ రెడ్డిపై ఆసక్తికర వ్యాఖ్యలు చేశారు. రేవంత్ పాదయాత్రకు తనను పిలవలేదని ఆయన వెల్లడించారు. మార్చి 16 నుంచి సీఎల్పీ నాయకుడు మల్లు భట్టి విక్రమార్క పాదయాత్ర చేయబోతున్నారు. ఈ నేపథ్యంలో విక్రమార్కతో ఆదివారం హైదరాబాద్ లోని తన నివాసంలో ఆయన భేటీ అయ్యారు. ఈ సందర్భంగా కోమటిరెడ్డి మాట్లాడుతూ.. విక్రమార్క పాదయాత్రలో తాను కూడా పాల్గొనబోతున్నట్టు చెప్పారు.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 10,
      slug: "tn-104",
      headline:
        "TSPSC పేపర్ లీక్ కేసు: అనుమానితులను సిట్ ఆరు రోజుల కస్టడీకి తీసుకుంది",
      category: "tn",
      img_url:
        "https://education.sakshi.com/sites/default/files/inline-images/tspsc%20police%20news_1.jpg",
      subjectsList: [
        "హైదరాబాద్‌: తెలంగాణ రాష్ట్ర పబ్లిక్‌ సర్వీస్‌ కమిషన్‌ (టీఎస్‌పీఎస్‌సీ) ప్రశ్నపత్రం లీక్‌ కేసును విచారిస్తున్న ప్రత్యేక దర్యాప్తు బృందం (సిట్‌) తొమ్మిది మంది అనుమానితులను ఆరు రోజుల పోలీసు కస్టడీకి తీసుకుంది.",
        "ఈ కేసులో నిందితులను మరింతగా విచారించాల్సి ఉన్నందున, మరిన్ని వివరాలు రాబట్టాల్సి ఉన్నందున వారిని ఒక వారం కస్టడీకి ఇవ్వాలని సిట్ అధికారులు గతంలో స్థానిక కోర్టులో పిటిషన్ దాఖలు చేశారు. శుక్రవారం ఇరుపక్షాల వాదనలు విన్న న్యాయస్థానం శనివారం నుంచి వీరి కస్టడీకి అనుమతిస్తూ ఉత్తర్వులు జారీ చేసింది.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 11,
      slug: "tn-105",
      headline: "ఎట్టకేలకు తెలంగాణకు మెగా టెక్స్‌టైల్ పార్క్.",
      category: "tn",
      img_url:
        "https://media.andhrajyothy.com/media/2023/20230317/1textile_3801a704bb_V_jpg--799x414-4g.webp",
      subjectsList: [
        "హైదరాబాద్: రాష్ట్రంలో మెగా టెక్స్‌టైల్ పార్క్ ఏర్పాటు చేయాలన్న తెలంగాణ ప్రభుత్వ చిరకాల డిమాండ్‌ను బీజేపీ నేతృత్వంలోని కేంద్రం ఎట్టకేలకు పరిగణనలోకి తీసుకుంది.",
        `పీఎం మిత్ర (మెగా ఇంటిగ్రేటెడ్ టెక్స్‌టైల్ రీజియన్ అండ్ అపెరల్) కింద తమిళనాడు, తెలంగాణ, కర్ణాటక, మహారాష్ట్ర, గుజరాత్, మధ్యప్రదేశ్, ఉత్తరప్రదేశ్‌లలో మెగా టెక్స్‌టైల్ పార్క్ ఏర్పాటు చేయనున్నట్లు ప్రధాని నరేంద్ర మోదీ శుక్రవారం ప్రకటించారు. తమిళనాడు మరియు తెలంగాణ కోసం సేవ్ చేయండి, మిగిలిన ఐదు బిజెపి పాలిత రాష్ట్రాలలో ఈ పార్కులు ఏర్పాటు చేయబడుతున్నాయి.`,
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 12,
      slug: "tn-106",
      headline:
        "బండి సంజయ్‌కు వ్యతిరేకంగా కెటి రామారావు విస్తృత ప్రయోగాలు చేశారు",
      category: "tn",
      img_url:
        "https://image.telanganatoday.com/wp-content/uploads/2022/05/KTR-Bandi_V_jpg--816x480-4g.webp?sw=1920&dsz=816x480&iw=659&p=false&r=1",
      subjectsList: [
        "హైదరాబాద్: బిజెపి రాష్ట్ర అధ్యక్షుడు బండి సంజయ్‌ చేసిన వ్యాఖ్యలపై బిఆర్‌ఎస్‌ వర్కింగ్‌ ప్రెసిడెంట్‌, ఐటి శాఖ మంత్రి కెటి రామారావు తీవ్ర మినహాయింపునిస్తూ రాజ్యాంగ సంస్థలు, ప్రభుత్వ శాఖల పనితీరుపై అవగాహన లేకుండా రాజకీయ ప్రేరేపిత వ్యాఖ్యలు చేశారని ఆరోపించారు. రాబోయే రోజుల్లో సంజయ్‌ రాజకీయ కుట్రలకు పాల్పడి క్రిమినల్‌ కేసులు ఎదుర్కొనే అవకాశం ఉందని హెచ్చరించారు.",
        `శుక్రవారం ఇక్కడ ఒక వివరణాత్మక ప్రకటనలో, TSPSC సమస్యపై సంజయ్ లేవనెత్తిన అసంబద్ధమైన మరియు ప్రేరేపిత ఆరోపణలపై రామారావు స్పందించారు. TSPSC ఒక స్వతంత్ర సంస్థ మరియు TSPSC వ్యవహారాల్లో రాష్ట్ర ప్రభుత్వ ప్రమేయం పరిమితంగా ఉంది. అయితే కమిషన్‌పై బండి సంజయ్‌ చేసిన వ్యాఖ్యలు ఆయన అవగాహనా రాహిత్యాన్ని, అజ్ఞానాన్ని నిరూపిస్తున్నాయని అన్నారు`,
      ],
      headline_subject: "హైలైట్ TN",
    },
  ],
  main_ap_special: [
    {
      id: 1,
      slug: "ap-101",
      category: "ap",
      headline: " జగన్ కనుసైగ చేస్తే చాలు..",
      img_url:
        "https://tmedia.net.in/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-09-at-9.21.34-PM.jpeg",
      subjectsList: [
        "వైఎస్సార్‌సీపీ (YSRCP)కి వ్యతిరేకంగా ఎలాంటి పొత్తులు పెట్టుకున్నా ఫర్వాలేదని.. పార్టీ యువతంతా సీఎం జగన్‌కు ప్రైవేట్ సైన్యంగా పనిచేస్తామన్నారు పార్టీ యువజన విభాగం రాష్ట్ర అధ్యక్షుడు, శాప్ ఛైర్మన్ బైరెడ్డి సిద్ధార్థరెడ్డి (Byreddy Siddharth Reddy). ",
        `రాజమండ్రిలో జక్కంపూడి గణేష్ ఆధ్వర్యంలో మెగా స్పోర్ట్స్ ఫెస్టివల్ ప్రారంభోత్సవంలో ఈ వ్యాఖ్యలు చేశారు. "ముఖ్యమంత్రి జగన్ మావాడు' అని ప్రజలు ఆయన్ను గుండెల్లో పెట్టుకున్నారని బైరెడ్డి అన్నారు. జక్కంపూడి కుటుంబం అంటే తమ సొంత కుటుంబం అనే భావన జిల్లా ప్రజల్లో ఉందన్నారు. పార్టీ యువజన విభాగం సీఎం జగన్‌కు రక్షణ వలయంలా పనిచేస్తుందన్నారు.`,
      ],
      headline_subject: "హైలైట్ AP",
    }
  ],
  main_tn_special: [
    {
      id: 1,
      slug: "ap-101",
      category: "ap",
      headline: " జగన్ కనుసైగ చేస్తే చాలు..",
      img_url:
        "https://tmedia.net.in/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-09-at-9.21.34-PM.jpeg",
      subjectsList: [
        "వైఎస్సార్‌సీపీ (YSRCP)కి వ్యతిరేకంగా ఎలాంటి పొత్తులు పెట్టుకున్నా ఫర్వాలేదని.. పార్టీ యువతంతా సీఎం జగన్‌కు ప్రైవేట్ సైన్యంగా పనిచేస్తామన్నారు పార్టీ యువజన విభాగం రాష్ట్ర అధ్యక్షుడు, శాప్ ఛైర్మన్ బైరెడ్డి సిద్ధార్థరెడ్డి (Byreddy Siddharth Reddy). ",
        `రాజమండ్రిలో జక్కంపూడి గణేష్ ఆధ్వర్యంలో మెగా స్పోర్ట్స్ ఫెస్టివల్ ప్రారంభోత్సవంలో ఈ వ్యాఖ్యలు చేశారు. "ముఖ్యమంత్రి జగన్ మావాడు' అని ప్రజలు ఆయన్ను గుండెల్లో పెట్టుకున్నారని బైరెడ్డి అన్నారు. జక్కంపూడి కుటుంబం అంటే తమ సొంత కుటుంబం అనే భావన జిల్లా ప్రజల్లో ఉందన్నారు. పార్టీ యువజన విభాగం సీఎం జగన్‌కు రక్షణ వలయంలా పనిచేస్తుందన్నారు.`,
      ],
      headline_subject: "హైలైట్ AP",
    }
  ],

  homeContent: [
    {
      id: 1,
      slug: "ap-101",
      category: "ap",
      headline: " జగన్ కనుసైగ చేస్తే చాలు..",
      img_url:
        "https://tmedia.net.in/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-09-at-9.21.34-PM.jpeg",
      subjectsList: [
        "వైఎస్సార్‌సీపీ (YSRCP)కి వ్యతిరేకంగా ఎలాంటి పొత్తులు పెట్టుకున్నా ఫర్వాలేదని.. పార్టీ యువతంతా సీఎం జగన్‌కు ప్రైవేట్ సైన్యంగా పనిచేస్తామన్నారు పార్టీ యువజన విభాగం రాష్ట్ర అధ్యక్షుడు, శాప్ ఛైర్మన్ బైరెడ్డి సిద్ధార్థరెడ్డి (Byreddy Siddharth Reddy). ",
        `రాజమండ్రిలో జక్కంపూడి గణేష్ ఆధ్వర్యంలో మెగా స్పోర్ట్స్ ఫెస్టివల్ ప్రారంభోత్సవంలో ఈ వ్యాఖ్యలు చేశారు. "ముఖ్యమంత్రి జగన్ మావాడు' అని ప్రజలు ఆయన్ను గుండెల్లో పెట్టుకున్నారని బైరెడ్డి అన్నారు. జక్కంపూడి కుటుంబం అంటే తమ సొంత కుటుంబం అనే భావన జిల్లా ప్రజల్లో ఉందన్నారు. పార్టీ యువజన విభాగం సీఎం జగన్‌కు రక్షణ వలయంలా పనిచేస్తుందన్నారు.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 2,
      slug: "ap-102",
      headline: "పులివెందులలో వైసీపీ కంటే టీడీపీకి ఎక్కువ ఓట్లు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98746813/98746813.jpg?imgsize=39548&width=540&height=405&resizemode=75",
      subjectsList: [
        "ఏపీ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల ఫలితాల్లో టీడీపీ రెండు స్థానాల్లో విజయం సాధించింది. తూర్పు రాయలసీమ స్థానం నుంచి కంచర్ల శ్రీకాంత్.. ఉత్తరాంధ్ర స్థానం నుంచి వేపాడ చిరంజీవిరావు గెలిచారు. ఇక మిగిలిన పశ్చిమ రాయలసీమ స్థానంలో హోరా హోరీగా కౌంటింగ్ సాగుతుండగా.. రెండో ప్రాధాన్యతా ఓట్ల లెక్కింపు జరుగుతోంది. దీంతో అందరి కళ్లు ఆ ఫలితం వైపు మళ్లింది.",
        `ఈ క్రమంలో పశ్చిమ రాయలసీమ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికలకు సంబంధించి ఓ ప్రచారం ఇప్పుడు వైరల్ అవుతోంది. ముఖ్యమంత్రి వైఎస్ జగన్ ప్రాతినిధ్యం వహిస్తున్న పులివెందుల నియోజకవర్గంలో అధికార వైఎస్సార్‌సీపీ అభ్యర్థి కంటే టీడీపీ అభ్యర్థికి ఎక్కువ ఓట్లు వచ్చాయని ప్రచారం జరుగుతోంది. `,
        `సోషల్ మీడియాలో పోస్టులు, ట్వీట్‌లు వైరల్ అవుతున్నాయి.. దీంతో ఏపీ ప్రభుత్వ ఫ్యాక్ట్‌ చెక్‌ విభాగం స్పందించింది. ఆ ప్రచారం వాస్తవం కాదని క్లారిటీ ఇచ్చింది. సోషల్‌ మీడియాలో జరుగుతున్న ఈ వాదన పూర్తిగా నిరాధారమని తేల్చి చెప్పింది.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 3,
      slug: "ap-106",
      headline: "నారా లోకేష్ పాదయాత్రకు బ్రేక్..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98571327/98571327.jpg?imgsize=74252&width=700&height=525&resizemode=75",
      subjectsList: [
        "తెలుగు దేశం పార్టీ (టీడీపీ) జాతీయ ప్రధాన కార్యదర్శి నారా లోకేష్‌ పాదయాత్రకు ఎన్నికల సంఘం బ్రేక్ ఇచ్చింది. లోకేష్ రిక్వెస్ట్‌ను ఎన్నికల సంఘం తోసిపుచ్చింది. దీంతో పాదయాత్రకు లోకేష్ బ్రేక్‌ ఇచ్చి హైదరాబాద్‌కు బయల్దేరారు. సోమవారం రాష్ట్రంలో గ్రాడ్యుయేట్స్, టీచర్స్ ఎమ్మెల్సీ ఎన్నికలు జరగనున్న విషయం తెలిసిందే. అన్నమయ్య జిల్లాలో తన పాదయాత్ర కొనసాగుతున్న తరుణంలో.. తాను కంటేవారిపల్లి విడిది కేంద్రంలో ఉండేందుకు మినహాయింపు ఇవ్వాలని కేంద్ర ఎన్నికల సంఘాన్ని లోకేష్ కోరారు.",
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 4,
      slug: "ap-107",
      headline:
        "ఓట్లు చీలడానికి వీల్లేదు.. ఆ పార్టీకి కూడా ఓటెయ్యండి: చంద్రబాబు",
      img_url:
        "https://telugu.samayam.com/thumb/98567309/98567309.jpg?imgsize=50962&width=700&height=525&resizemode=75",
      subjectsList: [
        "రాష్ట్రంలో ప్రజా వ్యతిరేక పాలన సాగిస్తున్న వైఎస్సార్ కాంగ్రెస్ పార్టీకి ఈ ఎమ్మెల్సీ ఎన్నికల్లో బుద్ధి చెప్పాలని తెలుగుదేశం పార్టీ అధినేత చంద్రబాబునాయుడు అన్నారు. ఈ ఎన్నికల్లో టీడీపీ అభ్యర్థులను గెలిపించాలని కోరారు. ఎన్నికల్లో ప్రలోభాలు, బోగస్ ఓట్లతో వైసీపీ అక్రమాలకు పాల్పడుతోందని తీవ్ర ఆగ్రహం వ్యక్తం చేశారు.",
        "ఈ మేరకు రాష్ట్ర ప్రజలకు శనివారం చంద్రబాబునాయుడు బహిరంగ లేఖ రాశారు. జగన్ ప్రభుత్వం అధికారంలోకి వచ్చినప్పటి నుంచి హక్కులను కాలరాస్తూ తమను ఎలా మోసం చేసిందో ఉద్యోగులు, టీచర్లు గుర్తించి ఈ ఎన్నికల్లో బుద్ధి చెప్పాలన్నారు. పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల్లో టీడీపీ అభ్యర్థులు వేపాడ చిరంజీవిరావు, కంచర్ల శ్రీకాంత్‌, భూంరెడ్డి రామ్‌గోపాల్‌ రెడ్డిని గెలిపించాలని విజ్ఞప్తి చేశారు.",
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 5,
      slug: "tn-103",
      headline: "రేవంత్ రెడ్డి పాదయాత్రకు నన్ను పిలవలేదు..",
      category: "tn",
      img_url:
        "https://assets.thehansindia.com/h-upload/2020/08/27/994555-komati-reddy.webp",
      subjectsList: [
        "కాంగ్రెస్ సీనియర్ నాయకుడు, భువనగిరి ఎంపీ కోమటిరెడ్డి వెంకట్ రెడ్డి మరోసారి రేవంత్ రెడ్డిపై ఆసక్తికర వ్యాఖ్యలు చేశారు. రేవంత్ పాదయాత్రకు తనను పిలవలేదని ఆయన వెల్లడించారు. మార్చి 16 నుంచి సీఎల్పీ నాయకుడు మల్లు భట్టి విక్రమార్క పాదయాత్ర చేయబోతున్నారు. ఈ నేపథ్యంలో విక్రమార్కతో ఆదివారం హైదరాబాద్ లోని తన నివాసంలో ఆయన భేటీ అయ్యారు. ఈ సందర్భంగా కోమటిరెడ్డి మాట్లాడుతూ.. విక్రమార్క పాదయాత్రలో తాను కూడా పాల్గొనబోతున్నట్టు చెప్పారు.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 6,
      slug: "tn-104",
      headline:
        "TSPSC పేపర్ లీక్ కేసు: అనుమానితులను సిట్ ఆరు రోజుల కస్టడీకి తీసుకుంది",
      category: "tn",
      img_url:
        "https://education.sakshi.com/sites/default/files/inline-images/tspsc%20police%20news_1.jpg",
      subjectsList: [
        "హైదరాబాద్‌: తెలంగాణ రాష్ట్ర పబ్లిక్‌ సర్వీస్‌ కమిషన్‌ (టీఎస్‌పీఎస్‌సీ) ప్రశ్నపత్రం లీక్‌ కేసును విచారిస్తున్న ప్రత్యేక దర్యాప్తు బృందం (సిట్‌) తొమ్మిది మంది అనుమానితులను ఆరు రోజుల పోలీసు కస్టడీకి తీసుకుంది.",
        "ఈ కేసులో నిందితులను మరింతగా విచారించాల్సి ఉన్నందున, మరిన్ని వివరాలు రాబట్టాల్సి ఉన్నందున వారిని ఒక వారం కస్టడీకి ఇవ్వాలని సిట్ అధికారులు గతంలో స్థానిక కోర్టులో పిటిషన్ దాఖలు చేశారు. శుక్రవారం ఇరుపక్షాల వాదనలు విన్న న్యాయస్థానం శనివారం నుంచి వీరి కస్టడీకి అనుమతిస్తూ ఉత్తర్వులు జారీ చేసింది.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 7,
      slug: "tn-105",
      headline: "ఎట్టకేలకు తెలంగాణకు మెగా టెక్స్‌టైల్ పార్క్.",
      category: "tn",
      img_url:
        "https://media.andhrajyothy.com/media/2023/20230317/1textile_3801a704bb_V_jpg--799x414-4g.webp",
      subjectsList: [
        "హైదరాబాద్: రాష్ట్రంలో మెగా టెక్స్‌టైల్ పార్క్ ఏర్పాటు చేయాలన్న తెలంగాణ ప్రభుత్వ చిరకాల డిమాండ్‌ను బీజేపీ నేతృత్వంలోని కేంద్రం ఎట్టకేలకు పరిగణనలోకి తీసుకుంది.",
        `పీఎం మిత్ర (మెగా ఇంటిగ్రేటెడ్ టెక్స్‌టైల్ రీజియన్ అండ్ అపెరల్) కింద తమిళనాడు, తెలంగాణ, కర్ణాటక, మహారాష్ట్ర, గుజరాత్, మధ్యప్రదేశ్, ఉత్తరప్రదేశ్‌లలో మెగా టెక్స్‌టైల్ పార్క్ ఏర్పాటు చేయనున్నట్లు ప్రధాని నరేంద్ర మోదీ శుక్రవారం ప్రకటించారు. తమిళనాడు మరియు తెలంగాణ కోసం సేవ్ చేయండి, మిగిలిన ఐదు బిజెపి పాలిత రాష్ట్రాలలో ఈ పార్కులు ఏర్పాటు చేయబడుతున్నాయి.`,
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 8,
      slug: "tn-106",
      headline:
        "బండి సంజయ్‌కు వ్యతిరేకంగా కెటి రామారావు విస్తృత ప్రయోగాలు చేశారు",
      category: "tn",
      img_url:
        "https://image.telanganatoday.com/wp-content/uploads/2022/05/KTR-Bandi_V_jpg--816x480-4g.webp?sw=1920&dsz=816x480&iw=659&p=false&r=1",
      subjectsList: [
        "హైదరాబాద్: బిజెపి రాష్ట్ర అధ్యక్షుడు బండి సంజయ్‌ చేసిన వ్యాఖ్యలపై బిఆర్‌ఎస్‌ వర్కింగ్‌ ప్రెసిడెంట్‌, ఐటి శాఖ మంత్రి కెటి రామారావు తీవ్ర మినహాయింపునిస్తూ రాజ్యాంగ సంస్థలు, ప్రభుత్వ శాఖల పనితీరుపై అవగాహన లేకుండా రాజకీయ ప్రేరేపిత వ్యాఖ్యలు చేశారని ఆరోపించారు. రాబోయే రోజుల్లో సంజయ్‌ రాజకీయ కుట్రలకు పాల్పడి క్రిమినల్‌ కేసులు ఎదుర్కొనే అవకాశం ఉందని హెచ్చరించారు.",
        `శుక్రవారం ఇక్కడ ఒక వివరణాత్మక ప్రకటనలో, TSPSC సమస్యపై సంజయ్ లేవనెత్తిన అసంబద్ధమైన మరియు ప్రేరేపిత ఆరోపణలపై రామారావు స్పందించారు. TSPSC ఒక స్వతంత్ర సంస్థ మరియు TSPSC వ్యవహారాల్లో రాష్ట్ర ప్రభుత్వ ప్రమేయం పరిమితంగా ఉంది. అయితే కమిషన్‌పై బండి సంజయ్‌ చేసిన వ్యాఖ్యలు ఆయన అవగాహనా రాహిత్యాన్ని, అజ్ఞానాన్ని నిరూపిస్తున్నాయని అన్నారు`,
      ],
      headline_subject: "హైలైట్ TN",
    },
  ],
  ap: [
    {
      id: 1,
      slug: "ap-101",
      category: "ap",
      headline: " జగన్ కనుసైగ చేస్తే చాలు..",
      img_url:
        "https://tmedia.net.in/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-09-at-9.21.34-PM.jpeg",
      subjectsList: [
        "వైఎస్సార్‌సీపీ (YSRCP)కి వ్యతిరేకంగా ఎలాంటి పొత్తులు పెట్టుకున్నా ఫర్వాలేదని.. పార్టీ యువతంతా సీఎం జగన్‌కు ప్రైవేట్ సైన్యంగా పనిచేస్తామన్నారు పార్టీ యువజన విభాగం రాష్ట్ర అధ్యక్షుడు, శాప్ ఛైర్మన్ బైరెడ్డి సిద్ధార్థరెడ్డి (Byreddy Siddharth Reddy). ",
        `రాజమండ్రిలో జక్కంపూడి గణేష్ ఆధ్వర్యంలో మెగా స్పోర్ట్స్ ఫెస్టివల్ ప్రారంభోత్సవంలో ఈ వ్యాఖ్యలు చేశారు. "ముఖ్యమంత్రి జగన్ మావాడు' అని ప్రజలు ఆయన్ను గుండెల్లో పెట్టుకున్నారని బైరెడ్డి అన్నారు. జక్కంపూడి కుటుంబం అంటే తమ సొంత కుటుంబం అనే భావన జిల్లా ప్రజల్లో ఉందన్నారు. పార్టీ యువజన విభాగం సీఎం జగన్‌కు రక్షణ వలయంలా పనిచేస్తుందన్నారు.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 2,
      slug: "ap-102",
      headline: "పులివెందులలో వైసీపీ కంటే టీడీపీకి ఎక్కువ ఓట్లు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98746813/98746813.jpg?imgsize=39548&width=540&height=405&resizemode=75",
      subjectsList: [
        "ఏపీ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల ఫలితాల్లో టీడీపీ రెండు స్థానాల్లో విజయం సాధించింది. తూర్పు రాయలసీమ స్థానం నుంచి కంచర్ల శ్రీకాంత్.. ఉత్తరాంధ్ర స్థానం నుంచి వేపాడ చిరంజీవిరావు గెలిచారు. ఇక మిగిలిన పశ్చిమ రాయలసీమ స్థానంలో హోరా హోరీగా కౌంటింగ్ సాగుతుండగా.. రెండో ప్రాధాన్యతా ఓట్ల లెక్కింపు జరుగుతోంది. దీంతో అందరి కళ్లు ఆ ఫలితం వైపు మళ్లింది.",
        `ఈ క్రమంలో పశ్చిమ రాయలసీమ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికలకు సంబంధించి ఓ ప్రచారం ఇప్పుడు వైరల్ అవుతోంది. ముఖ్యమంత్రి వైఎస్ జగన్ ప్రాతినిధ్యం వహిస్తున్న పులివెందుల నియోజకవర్గంలో అధికార వైఎస్సార్‌సీపీ అభ్యర్థి కంటే టీడీపీ అభ్యర్థికి ఎక్కువ ఓట్లు వచ్చాయని ప్రచారం జరుగుతోంది. `,
        `సోషల్ మీడియాలో పోస్టులు, ట్వీట్‌లు వైరల్ అవుతున్నాయి.. దీంతో ఏపీ ప్రభుత్వ ఫ్యాక్ట్‌ చెక్‌ విభాగం స్పందించింది. ఆ ప్రచారం వాస్తవం కాదని క్లారిటీ ఇచ్చింది. సోషల్‌ మీడియాలో జరుగుతున్న ఈ వాదన పూర్తిగా నిరాధారమని తేల్చి చెప్పింది.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 3,
      slug: "ap-103",
      headline: "ఎమ్మెల్సీ ఎన్నికల్లో గెలుపుతో గుడివాడలో సంబరాలు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98745698/98745698.jpg?imgsize=104986&width=700&height=525&resizemode=75",
      subjectsList: [
        "పీలో జరిగిన గ్రాడ్యుయేట్స్ ఎమ్మెల్సీ ఎన్నికల్లో టీడీపీ రెండుచోట్ల విజయం సాధించింది. ఈ సందర్భంగా రాష్ట్రవ్యాప్తంగా తెలుగు దేశం పార్టీ శ్రేణులు సంబరాలు చేసుకున్నారు. టపాసులు కాల్చి, స్వీట్లు పంచుకుని ఆనందాన్ని వ్యక్తం చేశారు. ఈ క్రమంలో గుడివాడలో కూడా తెలుగు తమ్ముళ్లు సంబరాలు జరిపారు.. ",
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 4,
      slug: "ap-104",
      headline: "ఎమ్మెల్సీ ఎన్నికల్లో టీడీపీ హవా!",
      category: "ap",
      img_url:
        "https://www.vaartha.com/wp-content/uploads/2023/03/tdp-full-happy-jpg.webp",
      subjectsList: [
        "ఉత్తరాంధ్ర పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల్లో తెలుగు దేశం పార్టీ అభ్యర్థి వేపాడ చిరంజీవి రావు ఘన విజయం సాధించారు. రెండు రోజుల పాటు ఉత్కంత భరితంగా సాగిన ఎన్నికల కౌంటింగ్‌లో మేజిక్ ఫిగర్ దాటేశారు. మొదటి ప్రాధాన్యతా ఓట్ల లెక్కింపులో 50 శాతానికి పైగా ఓట్లు రాకపోవడంతో ద్వితీయ ప్రాధాన్యత ఓట్లు లెక్కించారు.",
        `దీంతో ద్వితీయ ప్రాధాన్యత ఓట్ల లెక్కింపులో 94,510 మ్యాజిక్ ఫిగర్ సాధించారు. దీంతో ఎన్నికల అధికారులు చిరంజీవికి గ్రాడ్యుయేట్స్ ఎమ్మెల్సీగా ఎన్నికల్లో గెలుపొందినట్లు వెల్లడించారు.
మరోవైపు తూర్పు రాయలసీమ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల రెండో ప్రాధాన్యత ఓట్ల లెక్కింపులో తెలుగు దేశం పార్టీ అభ్యర్థి కంచర్ల శ్రీకాంత్ ఘన విజయం సాధించారు.`,
        ` ఈ క్రమంలో కంచర్ల శ్రీకాంత్ విజయంపై తెలుగు దేశం పార్టీ ట్వీట్ చేసింది. ‘‘టీడీపీ బలపరిచిన తూర్పు రాయలసీమ పట్టభద్రుల ఎమ్మెల్సీ అభ్యర్థి కంచర్ల శ్రీకాంత్ విజయం సాధించారు. ఇది ఉమ్మడి చిత్తూరు జిల్లాలో లోకేష్ యువగళం పాదయాత్ర ప్రభావమే అని ప్రజలు అంటున్నారు. జగన్ రెడ్డి భయపడినట్టే ఎమ్మెల్సీ ఎన్నికల్లో లోకేష్ దెబ్బ వైసీపీకి గట్టిగానే తగిలిందన్నమాట.’’ అని టీడీపీ పేర్కొంది.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 5,
      slug: "ap-105",
      headline: "ఇప్పటికైనా సీఎం జగన్ అంగీకరిస్తారా: బుద్దా వెంకన్న",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98751350/98751350.jpg?imgsize=24736&width=700&height=525&resizemode=75",
      subjectsList: [
        "ఏపీ గ్రాడ్యుయేట్స్ ఎమ్మెల్సీ ఎన్నికల్లో టీడీపీ విజయం సాధించడంతో రాష్ట్రవ్యాప్తంగా తెలుగు తమ్ముళ్ల సంబరాలు చేసుకున్నారు. విజయవాడలో టీడీపీ నేత బుద్దా వెంకన్న నివాసం టిడిపి శ్రేణులు చంద్రబాబు చిత్ర పటానికి పాలాభిషేకం చేశారు.",
        `అనంతరం పూల వర్షం, బాణా సంచా పేల్చి సందడి చేశారు. పట్టభద్రులు ఎమ్మెల్సీ ఎన్నికలలో మంచి తీర్పు ఇచ్చిన వారందరికీ పాదాభివందనం అన్నారు వెంకన్న. మళ్లీ‌ చంద్రబాబు సీఎం కావడం ఖాయం..‌ అందుకు ఈ‌ఫలితం నిదర్శనమన్నారు. కోట్లు ఖర్చు పెట్టిన వైఎస్సార్‌సీపీని ప్రజలు తిరస్కరించారన్నారు.`,
        `అడ్డదారుల్లో విజయం సాధించాలన్న వైఎస్సార్‌సీపీకి ప్రజలు బుద్ధి చెప్పారన్నారు. 151 సీట్లు ఇస్తే రాక్షస పాలన సాగిస్తున్న జగన్ ఇంటికి‌ వెళ్లడం ఖాయమని.. దేవుడు రాసిన స్క్రిప్ట్ కాబట్టే 14నెలలు ముందుగానే నీ ఓటమి కి బాటలు వేశారన్నారు. కుప్పంలో ‌చెత్త కుప్పను‌ కూడా కొట్టలేరని.. పులివెందులలోనే ప్రజలు పాలనను‌ వ్యతిరేకించారన్నారు. ఈ సెమీ ఫైనల్ లో ఓడిపోయిన జగన్.. ఇప్పుడు అయినా బుద్ది తెచ్చుకోవాలన్నారు.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 6,
      slug: "ap-106",
      headline: "నారా లోకేష్ పాదయాత్రకు బ్రేక్..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98571327/98571327.jpg?imgsize=74252&width=700&height=525&resizemode=75",
      subjectsList: [
        "తెలుగు దేశం పార్టీ (టీడీపీ) జాతీయ ప్రధాన కార్యదర్శి నారా లోకేష్‌ పాదయాత్రకు ఎన్నికల సంఘం బ్రేక్ ఇచ్చింది. లోకేష్ రిక్వెస్ట్‌ను ఎన్నికల సంఘం తోసిపుచ్చింది. దీంతో పాదయాత్రకు లోకేష్ బ్రేక్‌ ఇచ్చి హైదరాబాద్‌కు బయల్దేరారు. సోమవారం రాష్ట్రంలో గ్రాడ్యుయేట్స్, టీచర్స్ ఎమ్మెల్సీ ఎన్నికలు జరగనున్న విషయం తెలిసిందే. అన్నమయ్య జిల్లాలో తన పాదయాత్ర కొనసాగుతున్న తరుణంలో.. తాను కంటేవారిపల్లి విడిది కేంద్రంలో ఉండేందుకు మినహాయింపు ఇవ్వాలని కేంద్ర ఎన్నికల సంఘాన్ని లోకేష్ కోరారు.",
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 7,
      slug: "ap-107",
      headline:
        "ఓట్లు చీలడానికి వీల్లేదు.. ఆ పార్టీకి కూడా ఓటెయ్యండి: చంద్రబాబు",
      img_url:
        "https://telugu.samayam.com/thumb/98567309/98567309.jpg?imgsize=50962&width=700&height=525&resizemode=75",
      subjectsList: [
        "రాష్ట్రంలో ప్రజా వ్యతిరేక పాలన సాగిస్తున్న వైఎస్సార్ కాంగ్రెస్ పార్టీకి ఈ ఎమ్మెల్సీ ఎన్నికల్లో బుద్ధి చెప్పాలని తెలుగుదేశం పార్టీ అధినేత చంద్రబాబునాయుడు అన్నారు. ఈ ఎన్నికల్లో టీడీపీ అభ్యర్థులను గెలిపించాలని కోరారు. ఎన్నికల్లో ప్రలోభాలు, బోగస్ ఓట్లతో వైసీపీ అక్రమాలకు పాల్పడుతోందని తీవ్ర ఆగ్రహం వ్యక్తం చేశారు.",
        "ఈ మేరకు రాష్ట్ర ప్రజలకు శనివారం చంద్రబాబునాయుడు బహిరంగ లేఖ రాశారు. జగన్ ప్రభుత్వం అధికారంలోకి వచ్చినప్పటి నుంచి హక్కులను కాలరాస్తూ తమను ఎలా మోసం చేసిందో ఉద్యోగులు, టీచర్లు గుర్తించి ఈ ఎన్నికల్లో బుద్ధి చెప్పాలన్నారు. పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల్లో టీడీపీ అభ్యర్థులు వేపాడ చిరంజీవిరావు, కంచర్ల శ్రీకాంత్‌, భూంరెడ్డి రామ్‌గోపాల్‌ రెడ్డిని గెలిపించాలని విజ్ఞప్తి చేశారు.",
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 8,
      slug: "ap-108",
      headline: "పవన్‌ కల్యాణ్‌ది సెలబ్రిటీ పార్టీ: మంత్రి బొత్స",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98583972/botsa-vs-pawan-98583972.jpg?imgsize=999503&width=700&height=525&resizemode=75",
      subjectsList: [
        "పవన్‌పై మంత్రి బొత్స సెటైర్లు వేశారు. ప్రజలకు ఇచ్చిన హామీలన్నీ ముఖ్యమంత్రి వైఎస్‌ జగన్‌ మోహన్‌ రెడ్డి నెరవేర్చారని.. మంత్రి బొత్స వ్యాఖ్యానించారు. అన్ని వర్గాలకు సీఎం జగన్‌ అండగా నిలిచారని స్పష్టం చేశారు. బీసీల గురించి పవన్‌ కల్యాణ్‌ ఏదేదో మాట్లాడుతున్నారని.. సరైన అవగాహన లేకుండా ఆయన మాట్లాడుతున్నారని విమర్శించారు. ఏలూరులో ఇచ్చిన బీసీ డిక్లరేషన్‌ ప్రకారం.. రాష్ట్రంలో బీసీలకు ప్రయోజనం జరుగుతోందని మంత్రి బొత్స వివరించారు.",
      ],
      headline_subject: "హైలైట్ AP",
    },
  ],
  tn: [
    {
      id: 1,
      slug: "tn-101",
      headline: "సీఎం కేసీఆర్‌కు అస్వస్థత.. ఏఐజీ ఆస్పత్రికి తరలింపు",
      category: "tn",
      img_url:
        "https://images.10tv.in/wp-content/uploads/2023/03/CM-KCR_V_jpg--816x480-4g.webp?sw=1920&dsz=816x480&iw=765&p=false&r=1",
      subjectsList: [
        "తెలంగాణ ముఖ్యమంత్రి కల్వకుంట్ల చంద్రశేఖరరావు అస్వస్థతకు గురయ్యారు. ఆదివారం ఉదయం నుంచి కడుపునొప్పితో బాధపడుతున్న ఆయన్ను గచ్చిబౌలిలోని ఏఐజీ ఆస్పత్రికి కుటుంబ సభ్యులు తరలించారు. ఆస్పత్రిలో కేసీఆర్‌కు ప్రత్యేక వైద్య బృందం పరీక్షలు చేసింది. ఎండోస్కోపీ పరీక్షలు చేశారు వైద్యులు.",
        "అయితే జనరల్ చెకప్‌లో భాగంగానే ముఖ్యమంత్రి దంపతులు ఆస్పత్రికి వచ్చినట్లు ఏఐజీ ఆస్పత్రి వర్గాలు తెలిపాయి. మెడికల్ చెకప్ కోసం కేసీఆర్ ఎప్పుడూ యశోద, నిమ్స్ ఆస్పత్రులకు మాత్రమే వెళ్తుంటారు. అయితే ఏఐజీకి ఎందుకొచ్చారన్నదీ చర్చనీయాంశంగా మారింది.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 2,
      slug: "tn-102",
      headline: "హైదరాబాద్‌లో అమిత్ షా ..",
      category: "tn",
      img_url:
        "https://telugu.samayam.com/thumb/98581087/amit-shah-98581087.jpg?imgsize=51056&width=700&height=525&resizemode=75",
      subjectsList: [
        "కేంద్ర హోంశాఖ మంత్రి అమిత్ షా హైదరాబాద్ కు చేరుకున్నారు. శనివారం రాత్రి 11గంటలకు హైదరాబాద్ చేరుకున్న అమిత్ షాకు బీజేపీ రాష్ట్ర ఇన్‌ఛార్జి తరుణ్ ఛుగ్, రాష్ట్ర అధ్యక్షుడు బండి సంజయ్, కేంద్ర మంత్రి కిషన్ రెడ్డి, ఎంపీ లక్ష్మణ్ తదితరులు స్వాగతం పలికారు. వారితో అమిత్ షా కొద్దిసేపు ఎయిర్ పోర్టులోనే ముచ్చటించారు.",
        "ఈ క్రమంలో బీజేపీ రాష్ట్ర వ్యవహారాలతో పాటు బీఆర్ఎస్ ఎమ్మెల్సీ కవిత ఈడీ విచారణ నేపథ్యంలో రాష్ట్రంలో చోటుచేసుకున్న పరిణామాలు, పార్టీకి సంబంధించిన అంశాలపై చర్చించినట్లు సమాచారం. అయితే, ఆదివారం మరోసారి రాష్ట్ర పార్టీ నేతలతో అమిత్ షా సమావేశమయ్యే అవకాశాలు ఉన్నట్లు తెలుస్తోంది.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 3,
      slug: "tn-103",
      headline: "రేవంత్ రెడ్డి పాదయాత్రకు నన్ను పిలవలేదు..",
      category: "tn",
      img_url:
        "https://assets.thehansindia.com/h-upload/2020/08/27/994555-komati-reddy.webp",
      subjectsList: [
        "కాంగ్రెస్ సీనియర్ నాయకుడు, భువనగిరి ఎంపీ కోమటిరెడ్డి వెంకట్ రెడ్డి మరోసారి రేవంత్ రెడ్డిపై ఆసక్తికర వ్యాఖ్యలు చేశారు. రేవంత్ పాదయాత్రకు తనను పిలవలేదని ఆయన వెల్లడించారు. మార్చి 16 నుంచి సీఎల్పీ నాయకుడు మల్లు భట్టి విక్రమార్క పాదయాత్ర చేయబోతున్నారు. ఈ నేపథ్యంలో విక్రమార్కతో ఆదివారం హైదరాబాద్ లోని తన నివాసంలో ఆయన భేటీ అయ్యారు. ఈ సందర్భంగా కోమటిరెడ్డి మాట్లాడుతూ.. విక్రమార్క పాదయాత్రలో తాను కూడా పాల్గొనబోతున్నట్టు చెప్పారు.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 4,
      slug: "tn-104",
      headline:
        "TSPSC పేపర్ లీక్ కేసు: అనుమానితులను సిట్ ఆరు రోజుల కస్టడీకి తీసుకుంది",
      category: "tn",
      img_url:
        "https://education.sakshi.com/sites/default/files/inline-images/tspsc%20police%20news_1.jpg",
      subjectsList: [
        "హైదరాబాద్‌: తెలంగాణ రాష్ట్ర పబ్లిక్‌ సర్వీస్‌ కమిషన్‌ (టీఎస్‌పీఎస్‌సీ) ప్రశ్నపత్రం లీక్‌ కేసును విచారిస్తున్న ప్రత్యేక దర్యాప్తు బృందం (సిట్‌) తొమ్మిది మంది అనుమానితులను ఆరు రోజుల పోలీసు కస్టడీకి తీసుకుంది.",
        "ఈ కేసులో నిందితులను మరింతగా విచారించాల్సి ఉన్నందున, మరిన్ని వివరాలు రాబట్టాల్సి ఉన్నందున వారిని ఒక వారం కస్టడీకి ఇవ్వాలని సిట్ అధికారులు గతంలో స్థానిక కోర్టులో పిటిషన్ దాఖలు చేశారు. శుక్రవారం ఇరుపక్షాల వాదనలు విన్న న్యాయస్థానం శనివారం నుంచి వీరి కస్టడీకి అనుమతిస్తూ ఉత్తర్వులు జారీ చేసింది.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 5,
      slug: "tn-105",
      headline: "ఎట్టకేలకు తెలంగాణకు మెగా టెక్స్‌టైల్ పార్క్.",
      category: "tn",
      img_url:
        "https://media.andhrajyothy.com/media/2023/20230317/1textile_3801a704bb_V_jpg--799x414-4g.webp",
      subjectsList: [
        "హైదరాబాద్: రాష్ట్రంలో మెగా టెక్స్‌టైల్ పార్క్ ఏర్పాటు చేయాలన్న తెలంగాణ ప్రభుత్వ చిరకాల డిమాండ్‌ను బీజేపీ నేతృత్వంలోని కేంద్రం ఎట్టకేలకు పరిగణనలోకి తీసుకుంది.",
        `పీఎం మిత్ర (మెగా ఇంటిగ్రేటెడ్ టెక్స్‌టైల్ రీజియన్ అండ్ అపెరల్) కింద తమిళనాడు, తెలంగాణ, కర్ణాటక, మహారాష్ట్ర, గుజరాత్, మధ్యప్రదేశ్, ఉత్తరప్రదేశ్‌లలో మెగా టెక్స్‌టైల్ పార్క్ ఏర్పాటు చేయనున్నట్లు ప్రధాని నరేంద్ర మోదీ శుక్రవారం ప్రకటించారు. తమిళనాడు మరియు తెలంగాణ కోసం సేవ్ చేయండి, మిగిలిన ఐదు బిజెపి పాలిత రాష్ట్రాలలో ఈ పార్కులు ఏర్పాటు చేయబడుతున్నాయి.`,
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 6,
      slug: "tn-106",
      headline:
        "బండి సంజయ్‌కు వ్యతిరేకంగా కెటి రామారావు విస్తృత ప్రయోగాలు చేశారు",
      category: "tn",
      img_url:
        "https://image.telanganatoday.com/wp-content/uploads/2022/05/KTR-Bandi_V_jpg--816x480-4g.webp?sw=1920&dsz=816x480&iw=659&p=false&r=1",
      subjectsList: [
        "హైదరాబాద్: బిజెపి రాష్ట్ర అధ్యక్షుడు బండి సంజయ్‌ చేసిన వ్యాఖ్యలపై బిఆర్‌ఎస్‌ వర్కింగ్‌ ప్రెసిడెంట్‌, ఐటి శాఖ మంత్రి కెటి రామారావు తీవ్ర మినహాయింపునిస్తూ రాజ్యాంగ సంస్థలు, ప్రభుత్వ శాఖల పనితీరుపై అవగాహన లేకుండా రాజకీయ ప్రేరేపిత వ్యాఖ్యలు చేశారని ఆరోపించారు. రాబోయే రోజుల్లో సంజయ్‌ రాజకీయ కుట్రలకు పాల్పడి క్రిమినల్‌ కేసులు ఎదుర్కొనే అవకాశం ఉందని హెచ్చరించారు.",
        `శుక్రవారం ఇక్కడ ఒక వివరణాత్మక ప్రకటనలో, TSPSC సమస్యపై సంజయ్ లేవనెత్తిన అసంబద్ధమైన మరియు ప్రేరేపిత ఆరోపణలపై రామారావు స్పందించారు. TSPSC ఒక స్వతంత్ర సంస్థ మరియు TSPSC వ్యవహారాల్లో రాష్ట్ర ప్రభుత్వ ప్రమేయం పరిమితంగా ఉంది. అయితే కమిషన్‌పై బండి సంజయ్‌ చేసిన వ్యాఖ్యలు ఆయన అవగాహనా రాహిత్యాన్ని, అజ్ఞానాన్ని నిరూపిస్తున్నాయని అన్నారు`,
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 7,
      slug: "tn-107",
      headline:
        "హైదరాబాద్: రాజేంద్రనగర్‌లోని ప్లాస్టిక్‌ గోదాములో భారీ అగ్నిప్రమాదం జరిగింది",
      category: "tn",
      img_url:
        "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202303/screenshot_415-sixteen_nine.png?VersionId=KLuZRbuAVhbZyXAPip0JOns30xBNROBC&size=690:388",
      subjectsList: [
        "హైదరాబాద్: రాజేంద్రనగర్‌లోని శాస్త్రిపురంలోని ఓ ప్లాస్టిక్ గోదాములో శనివారం తెల్లవారుజామున భారీ అగ్నిప్రమాదం జరిగింది. ఎలాంటి ప్రాణనష్టం జరగలేదు.",
        `షార్ట్ సర్క్యూట్ కారణంగా మంటలు చెలరేగినట్లు పోలీసులు అనుమానిస్తున్నారు. గోదాం ఆవరణలో ఉన్న రెండు లారీలు, ప్లాస్టిక్‌ వస్తువులు అగ్నికి ఆహుతయ్యాయి.`,
        `దట్టమైన మంటలు, పొగలు రావడం గమనించిన స్థానికులు వెంటనే అగ్నిమాపక శాఖ, పోలీసులకు సమాచారం అందించారు. అగ్నిమాపక సిబ్బంది ఘటనాస్థలికి చేరుకుని నాలుగు ఫైరింజన్ల సాయంతో మంటలను అదుపు చేశారు.`,
        `పోలీసులు విచారిస్తున్నారు.`,
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 8,
      slug: "tn-108",
      headline: "హైదరాబాద్: స్వప్నలోక్ అసోసియేషన్‌పై కేసు నమోదైంది",
      category: "tn",
      img_url:
        "https://image.telanganatoday.com/wp-content/uploads/2023/03/Swapnalak-complex_V_jpg--816x480-4g.webp?sw=1920&dsz=816x480&iw=659&p=false&r=1",
      subjectsList: [
        "హైదరాబాద్: గురువారం రాత్రి జరిగిన అగ్నిప్రమాదంలో ఆరుగురు యువకులను బలితీసుకున్న ఘటనలో స్వప్నలోక్ సూర్యకిరణ్ ఎస్టాబ్లిష్‌మెంట్ అసోసియేషన్ తదితరులపై మహంకాళి పోలీసులు శుక్రవారం కేసు నమోదు చేశారు.",
        `కాంప్లెక్స్‌ సూపర్‌వైజర్‌ పి శ్రీనివాస్‌ ఫిర్యాదు మేరకు స్వప్నలోక్‌ సూర్యకిరణ్‌ అసోసియేషన్‌, కెడియా ఇన్‌ఫోటెక్‌ లిమిటెడ్‌, వికాస్‌ పేపర్‌ ప్యాకేజింగ్‌ లిమిటెడ్‌పై హత్యాకాండ, మోసం, స్వచ్ఛందంగా గాయపర్చడం, పేలుడు పదార్థాల చట్టం కింద నేరపూరిత నరహత్య కింద కేసు నమోదు చేశారు. మరియు బాధితులు పనిచేస్తున్న QNet మరియు Vihan Direct Selling Pvt Ltdకి వ్యతిరేకంగా.`,
      ],
      headline_subject: "హైలైట్ TN",
    },
  ],
  ent: [
    {
      id: 1,
      slug: "ent-101",
      headline: "విశ్వక్ సేన్ తన వెర్షన్ 2.0ని దాస్ కా ధమ్కీతో ప్రారంభించాడు",
      category: "ent",
      img_url: "https://pynr.in/wp-content/uploads/2023/03/Vishwak-Sen.jpg",
      subjectsList: [
        `విశ్వక్ సేన్ త్వరలో విడుదల కాబోతున్న దాస్ కా ధమ్కీపై చాలా నమ్మకంగా ఉన్నాడు. మార్చి 22న ఈ చిత్రం పలు భాషల్లో విడుదల కానుంది. విశ్వక్ సేన్‌కి ఇది మొదటి పాన్-ఇండియన్ చిత్రం.`,
        `అలాగే, నటుడిగానే కాకుండా దర్శకుడిగా మరియు నిర్మాతగా విశ్వక్ సేన్ యొక్క రెండవ చిత్రంగా దాస్ కా ధమ్కి గుర్తింపు పొందింది. ఈరోజు, విశ్వక్ సేన్ దాస్ కా ధామ్కి కోసం గ్రాండ్ ప్రీ-రిలీజ్ ఈవెంట్‌ను నిర్వహించాడు, అతని అభిమాన నటుడు జూనియర్ ఎన్టీఆర్ దానిని ఆదరించారు.`,
      ],
      headline_subject: "Movie",
    },
    {
      id: 1,
      slug: "ent-102",
      headline: "అమిత్ షా రామ్ చరణ్‌ను కలిసి శుభాకాంక్షలు తెలిపారు",
      category: "ent",
      img_url:
        "https://cdn.tollywood.net/wp-content/uploads/2023/03/Ram-Charan-and-Chiranjeevi-meet-Amit-Shah-jpg.webp",
      subjectsList: [
        `న్యూఢిల్లీ: కొద్ది గంటల క్రితం న్యూఢిల్లీలో జరిగిన ఇండియా టుడే సదస్సులో కేంద్రమంత్రి అమిత్ షా పాల్గొన్నారు. అమిత్ షాతో పాటు వివిధ రంగాలకు చెందిన పలువురు ప్రముఖులు ఈ కార్యక్రమానికి హాజరయ్యారు. ఈ వేడుకకు తన తండ్రి చిరంజీవితో పాటు రామ్ చరణ్ కూడా హాజరయ్యారు.`,
        `రామ్ చరణ్ ఈరోజు ఉదయం లాస్ ఏంజెల్స్ నుంచి తిరిగొచ్చాడు. వెంటనే తన తండ్రితో కలిసి ఇండియా టుడే కాన్‌క్లేవ్‌కి వెళ్లాడు. అమిత్ షా అక్కడ రామ్ చరణ్ మరియు చిరంజీవిని వ్యక్తిగతంగా కలుసుకున్నారు మరియు చిత్రానికి ఆస్కార్ గెలుచుకున్న RRR నటుడిని అభినందించారు. రామ్ చరణ్‌కు అమిత్ షా సౌకర్యాలు కల్పించగా, దానికి ప్రతిగా చిరంజీవి కేంద్ర మంత్రికి కూడా అదే చేశారు. దేశం మొత్తం తరపున మెగా పవర్‌స్టార్‌కి అమిత్ షా సంతోషం వ్యక్తం చేశారు. ఆస్కార్‌ గెలుపొందడం గర్వకారణమని ఆయన పేర్కొన్నారు.`,
      ],
      headline_subject: "Movie",
    },
    {
      id: 3,
      slug: "ent-103",
      headline: "కాజల్ అగర్వాల్ నటించిన ఖోస్తీ సినిమా ఉగాదికి విడుదల కానుంది",
      category: "ent",
      img_url:
        "https://pro.sgp1.digitaloceanspaces.com/2023/03/ghosty--1--1.JPEG",
      subjectsList: [
        `కాజల్ అగర్వాల్ తాజా చిత్రం ఖోస్తీ కూడా తెలుగులో ఖోస్తీ పేరుతో విడుదల కానుంది. ఉగాది సందర్భంగా మార్చి 22న సినిమా విడుదల తేదీని నిర్ణయించారు. నిజానికి ఈ చిత్రం తమిళంలో ఈరోజు విడుదలైంది, అయితే తెలుగులో విడుదలకు పోటీగా ఉండటంతో తెలుగు విడుదల తేదీని నవీకరించారు.`,
        `ఈ చిత్రంలో కాజల్ అగర్వాల్ ద్విపాత్రాభినయంలో కనిపించనుంది. అందులో ఒకటి పోలీసు పాత్ర. ఖోస్తీకి కళ్యాణ్ దర్శకత్వం వహించారు. ఖోస్తీ అనేది ట్రయిలర్ మరియు ఇతర ప్రచార సామగ్రి నుండి చూసినట్లుగా, స్వచ్ఛమైన హారర్ కామెడీ డ్రామా చిత్రం.`,
      ],
      headline_subject: "Movie",
    },
    {
      id: 4,
      slug: "ent-104",
      headline: "దసరా: సెన్సార్, రన్‌టైమ్ మరియు ఇతర వివరాలు",
      category: "ent",
      img_url:
        "https://assets.thehansindia.com/h-upload/2023/03/13/1341450-dasarafulld.webp",
      subjectsList: [
        `ప్రస్తుతం ఎక్కడ చూసినా దసరా గురించే చర్చ. దసరా ట్రైలర్ సృష్టించిన బీభత్సమే ఇందుకు కారణం. ముఖ్యంగా దర్శకుడు శ్రీకాంత్ ఒదెల తీసుకున్న రా మరియు రియలిస్టిక్ విధానంతో ట్రైలర్ అద్భుతంగా ఉంది. `,
        `నాని బీస్ట్ మోడ్ కేవలం చంపేస్తోంది. మార్చి 30న దసరా విడుదల కోసం తెలుగు ప్రేక్షకులే కాకుండా యావత్ దేశంలోని సినీ ప్రేమికులు కూడా ఎదురుచూస్తున్నారు. ఇదిలా ఉంటే దసరాకి మేకర్స్ ఈ సినిమా సెన్సార్ ఫార్మాలిటీస్ పూర్తి చేశారు. వివరాలు ఇలా ఉన్నాయి.`,
      ],
      headline_subject: "Movie",
    },
    {
      id: 5,
      slug: "ent-105",
      headline: "అల్లు అర్జున్: హీరోయిన్‌ను సోషల్ మీడియాలో బ్లాక్ చేసిన బన్నీ!",
      category: "ent",
      img_url:
        "https://static-koimoi.akamaized.net/wp-content/new-galleries/2021/12/allu-arjun-apologises-to-irate-journo-after-delay-at-press-meet-001.jpg",
      subjectsList: [
        `మెగా కాంపౌండ్ నుంచి ఎంట్రీ ఇచ్చినప్పటికి తనకంటూ ప్రత్యేక గుర్తింపును సంపాదించుకున్న నటుడు అల్లు అర్జున్ (Allu Arjun). ‘నా పేరు సూర్య, నా ఇల్లు ఇండియా’, ‘అల వైకుంఠపురంలో’ వంటి చిత్రాలతో ప్రేక్షకులను అలరించారు. `,
        ` ఫ్యాన్స్ కోసం ప్రత్యేకంగా సమయాన్ని కేటాయిస్తారని బన్నీకి పేరుంది. ఫంక్షన్స్ జరిగిన ప్రతిసారి వారికి సెల్ఫీలు, ఫొటోలు కూడా ఇస్తుంటారు. ఫ్యాన్స్‌పై ఇంత అభిమానాన్ని చూపించే బన్నీ తన సహ నటిపై మాత్రం దానిని చూపించలేకపోయారు. తనతో కలసి సినిమా చేసిన హీరోయిన్‌ను సోషల్ మీడియాలో అల్లు అర్జున్ బ్లాక్ చేయడం ఇందుకు కారణం.`,
      ],
      headline_subject: "Movie",
    },
  ],
  sprt: [
    {
      id: 1,
      slug: "sprt-101",
      headline:
        "WTC ఫైనల్‌కు ముందు సెలెక్టర్‌లను ఆసక్తిగా ఉంచడంలో KL రాహుల్ చాలా బాగా చేసాడు: రవిశాస్త్రి",
      category: "sprt",
      img_url: "https://circleofcricket.com/post_image/post_image_64280ce.jpg",
      subjectsList: [
        `ముంబయి: జూన్‌లో అదే ప్రత్యర్థితో జరిగిన ప్రపంచ టెస్ట్ ఛాంపియన్‌షిప్ (డబ్ల్యుటిసి) ఫైనల్‌కు ముందు జాతీయ సెలక్టర్లను ఆసక్తిగా ఉంచడానికి ఆస్ట్రేలియాతో జరిగిన మొదటి వన్డేలో వికెట్ కీపర్-బ్యాటర్ కెఎల్ రాహుల్ బాగా రాణించాడని భారత మాజీ ప్రధాన కోచ్ రవిశాస్త్రి అభిప్రాయపడ్డాడు.`,
        `189 పరుగుల ఛేదనలో ఆస్ట్రేలియాను 188 పరుగులకు ఆలౌట్ చేయడంతో భారత్ 19.2 ఓవర్లలో 83/5 వద్ద అనిశ్చిత పరిస్థితిలో ఉంది. స్టీవ్ స్మిత్ యొక్క అద్భుతమైన డైవింగ్ క్యాచ్‌ని అందుకున్న రాహుల్, తన గ్లోవ్‌వర్క్‌తో చక్కటి పనిని చేశాడు, తర్వాత అజేయంగా 75 పరుగులు చేయడం ద్వారా ఒత్తిడికి లోనైన పరిస్థితిలో అడుగుపెట్టాడు.`,
      ],
      headline_subject: "Sports",
    },
    {
      id: 2,
      slug: "sprt-102",
      headline:
        "NZ vs SL, 2వ టెస్ట్ | విలియమ్సన్, నికోల్స్ డబుల్ సెంచరీలతో న్యూజిలాండ్‌ను అగ్రస్థానంలో నిలిపారు",
      category: "sprt",
      img_url:
        "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/yNlHeBnC4BE_DfVeecOKzallwXI=/800x0/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/32YPX6WJMJFBXX5GMPSB4LLONU.jpg",
      subjectsList: [
        `కేన్ విలియమ్సన్ మరియు హెన్రీ నికోల్స్ మూడో వికెట్‌కు 363 పరుగుల భాగస్వామ్యంలో డబుల్ సెంచరీలు చేయడంతో న్యూజిలాండ్ 580-4 పరుగులు చేసి శ్రీలంకతో రెండో క్రికెట్ టెస్ట్ రెండో రోజు శనివారం తన మొదటి ఇన్నింగ్స్‌ను డిక్లేర్ చేసింది.`,
        `విలియమ్సన్ తన ఆరవ డబుల్ సెంచరీని నమోదు చేశాడు మరియు 215 పరుగుల వద్ద అవుట్ అయ్యాడు మరియు నికోల్స్ న్యూజిలాండ్ కోసం అతని మొదటి మరియు అత్యధిక టెస్ట్ స్కోరును అందించాడు మరియు కెప్టెన్ టిమ్ సౌతీ డిక్లరేషన్‌ను ప్రకటించినప్పుడు 200 నాటౌట్‌గా ఉన్నాడు.`,
        `ఒక టెస్టులో ఒకే ఇన్నింగ్స్‌లో ఇద్దరు న్యూజిలాండ్ బ్యాట్స్‌మెన్ డబుల్ సెంచరీలు చేయడం ఇదే తొలిసారి.`,
      ],
      headline_subject: "sports",
    },
    {
      id: 3,
      slug: "sprt-103",
      headline:
        "సిడ్నీ మెక్‌లాఫ్లిన్-లెవ్రోన్: తన సామ్రాజ్యాన్ని విస్తరించాలని చూస్తున్న రాణి",
      category: "sprt",
      img_url:
        "https://sportnewsafrica.com/wp-content/uploads/2022/12/Sydney-Mclaughlin-1.webp",
      subjectsList: [
        `అమెరికన్ 400 మీటర్ల హర్డిల్స్ ప్రపంచ రికార్డును నాలుగు సార్లు బద్దలు కొట్టాడు. ప్రపంచ మరియు ఒలింపిక్ ఛాంపియన్ ఈవెంట్ యొక్క పరిమితులను కొనసాగించాలని కోరుకుంటాడు, అయితే 400m ఫ్లాట్ మరియు 100m హర్డిల్స్‌లో కూడా అడుగుపెట్టాడు`,
        `ట్రాక్ మరియు ఫీల్డ్ యొక్క సుదీర్ఘ చరిత్రలో సిడ్నీ మెక్‌లాఫ్లిన్-లెవ్రోన్ 400 మీటర్ల హర్డిల్స్‌లో గుత్తాధిపత్యం సాధించిన పద్ధతిలో వారి ఈవెంట్‌లో కొంతమంది అథ్లెట్లు మాత్రమే ఆధిపత్యం చెలాయించారు.`,
        `మెక్‌లాఫ్లిన్-లెవ్రోన్‌కు ముందు ఉన్న హర్డిల్స్ ప్రపంచంలో, రికార్డుల నుండి సెకనుల భిన్నాలను షేవ్ చేయడానికి సంవత్సరాలు పట్టింది మరియు రేసులను గెలవడం అంటే చరిత్రను తిరిగి వ్రాయడం కాదు. అయితే జీవితంలో ఒక్కసారైనా వచ్చే అథ్లెట్ రికార్డులను ధ్వంసం చేసినంత త్వరగా ఆ ఆలోచనను తుడిచిపెట్టేస్తోంది.`,
      ],
      headline_subject: "Sports",
    },
  ],
  banner: [
    {
      id: 1,
      slug: "ap-101",
      category: "ap",
      headline: " జగన్ కనుసైగ చేస్తే చాలు..",
      img_url:
        "https://tmedia.net.in/wp-content/uploads/2023/01/WhatsApp-Image-2023-01-09-at-9.21.34-PM.jpeg",
      subjectsList: [
        "వైఎస్సార్‌సీపీ (YSRCP)కి వ్యతిరేకంగా ఎలాంటి పొత్తులు పెట్టుకున్నా ఫర్వాలేదని.. పార్టీ యువతంతా సీఎం జగన్‌కు ప్రైవేట్ సైన్యంగా పనిచేస్తామన్నారు పార్టీ యువజన విభాగం రాష్ట్ర అధ్యక్షుడు, శాప్ ఛైర్మన్ బైరెడ్డి సిద్ధార్థరెడ్డి (Byreddy Siddharth Reddy). ",
        `రాజమండ్రిలో జక్కంపూడి గణేష్ ఆధ్వర్యంలో మెగా స్పోర్ట్స్ ఫెస్టివల్ ప్రారంభోత్సవంలో ఈ వ్యాఖ్యలు చేశారు. "ముఖ్యమంత్రి జగన్ మావాడు' అని ప్రజలు ఆయన్ను గుండెల్లో పెట్టుకున్నారని బైరెడ్డి అన్నారు. జక్కంపూడి కుటుంబం అంటే తమ సొంత కుటుంబం అనే భావన జిల్లా ప్రజల్లో ఉందన్నారు. పార్టీ యువజన విభాగం సీఎం జగన్‌కు రక్షణ వలయంలా పనిచేస్తుందన్నారు.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 2,
      slug: "ap-102",
      headline: "పులివెందులలో వైసీపీ కంటే టీడీపీకి ఎక్కువ ఓట్లు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98746813/98746813.jpg?imgsize=39548&width=540&height=405&resizemode=75",
      subjectsList: [
        "ఏపీ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల ఫలితాల్లో టీడీపీ రెండు స్థానాల్లో విజయం సాధించింది. తూర్పు రాయలసీమ స్థానం నుంచి కంచర్ల శ్రీకాంత్.. ఉత్తరాంధ్ర స్థానం నుంచి వేపాడ చిరంజీవిరావు గెలిచారు. ఇక మిగిలిన పశ్చిమ రాయలసీమ స్థానంలో హోరా హోరీగా కౌంటింగ్ సాగుతుండగా.. రెండో ప్రాధాన్యతా ఓట్ల లెక్కింపు జరుగుతోంది. దీంతో అందరి కళ్లు ఆ ఫలితం వైపు మళ్లింది.",
        `ఈ క్రమంలో పశ్చిమ రాయలసీమ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికలకు సంబంధించి ఓ ప్రచారం ఇప్పుడు వైరల్ అవుతోంది. ముఖ్యమంత్రి వైఎస్ జగన్ ప్రాతినిధ్యం వహిస్తున్న పులివెందుల నియోజకవర్గంలో అధికార వైఎస్సార్‌సీపీ అభ్యర్థి కంటే టీడీపీ అభ్యర్థికి ఎక్కువ ఓట్లు వచ్చాయని ప్రచారం జరుగుతోంది. `,
        `సోషల్ మీడియాలో పోస్టులు, ట్వీట్‌లు వైరల్ అవుతున్నాయి.. దీంతో ఏపీ ప్రభుత్వ ఫ్యాక్ట్‌ చెక్‌ విభాగం స్పందించింది. ఆ ప్రచారం వాస్తవం కాదని క్లారిటీ ఇచ్చింది. సోషల్‌ మీడియాలో జరుగుతున్న ఈ వాదన పూర్తిగా నిరాధారమని తేల్చి చెప్పింది.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 3,
      slug: "ap-103",
      headline: "ఎమ్మెల్సీ ఎన్నికల్లో గెలుపుతో గుడివాడలో సంబరాలు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98745698/98745698.jpg?imgsize=104986&width=700&height=525&resizemode=75",
      subjectsList: [
        "పీలో జరిగిన గ్రాడ్యుయేట్స్ ఎమ్మెల్సీ ఎన్నికల్లో టీడీపీ రెండుచోట్ల విజయం సాధించింది. ఈ సందర్భంగా రాష్ట్రవ్యాప్తంగా తెలుగు దేశం పార్టీ శ్రేణులు సంబరాలు చేసుకున్నారు. టపాసులు కాల్చి, స్వీట్లు పంచుకుని ఆనందాన్ని వ్యక్తం చేశారు. ఈ క్రమంలో గుడివాడలో కూడా తెలుగు తమ్ముళ్లు సంబరాలు జరిపారు.. ",
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 4,
      slug: "tn-101",
      headline: "సీఎం కేసీఆర్‌కు అస్వస్థత.. ఏఐజీ ఆస్పత్రికి తరలింపు",
      category: "tn",
      img_url:
        "https://images.10tv.in/wp-content/uploads/2023/03/CM-KCR_V_jpg--816x480-4g.webp?sw=1920&dsz=816x480&iw=765&p=false&r=1",
      subjectsList: [
        "తెలంగాణ ముఖ్యమంత్రి కల్వకుంట్ల చంద్రశేఖరరావు అస్వస్థతకు గురయ్యారు. ఆదివారం ఉదయం నుంచి కడుపునొప్పితో బాధపడుతున్న ఆయన్ను గచ్చిబౌలిలోని ఏఐజీ ఆస్పత్రికి కుటుంబ సభ్యులు తరలించారు. ఆస్పత్రిలో కేసీఆర్‌కు ప్రత్యేక వైద్య బృందం పరీక్షలు చేసింది. ఎండోస్కోపీ పరీక్షలు చేశారు వైద్యులు.",
        "అయితే జనరల్ చెకప్‌లో భాగంగానే ముఖ్యమంత్రి దంపతులు ఆస్పత్రికి వచ్చినట్లు ఏఐజీ ఆస్పత్రి వర్గాలు తెలిపాయి. మెడికల్ చెకప్ కోసం కేసీఆర్ ఎప్పుడూ యశోద, నిమ్స్ ఆస్పత్రులకు మాత్రమే వెళ్తుంటారు. అయితే ఏఐజీకి ఎందుకొచ్చారన్నదీ చర్చనీయాంశంగా మారింది.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 5,
      slug: "tn-102",
      headline: "హైదరాబాద్‌లో అమిత్ షా ..",
      category: "tn",
      img_url:
        "https://telugu.samayam.com/thumb/98581087/amit-shah-98581087.jpg?imgsize=51056&width=700&height=525&resizemode=75",
      subjectsList: [
        "కేంద్ర హోంశాఖ మంత్రి అమిత్ షా హైదరాబాద్ కు చేరుకున్నారు. శనివారం రాత్రి 11గంటలకు హైదరాబాద్ చేరుకున్న అమిత్ షాకు బీజేపీ రాష్ట్ర ఇన్‌ఛార్జి తరుణ్ ఛుగ్, రాష్ట్ర అధ్యక్షుడు బండి సంజయ్, కేంద్ర మంత్రి కిషన్ రెడ్డి, ఎంపీ లక్ష్మణ్ తదితరులు స్వాగతం పలికారు. వారితో అమిత్ షా కొద్దిసేపు ఎయిర్ పోర్టులోనే ముచ్చటించారు.",
        "ఈ క్రమంలో బీజేపీ రాష్ట్ర వ్యవహారాలతో పాటు బీఆర్ఎస్ ఎమ్మెల్సీ కవిత ఈడీ విచారణ నేపథ్యంలో రాష్ట్రంలో చోటుచేసుకున్న పరిణామాలు, పార్టీకి సంబంధించిన అంశాలపై చర్చించినట్లు సమాచారం. అయితే, ఆదివారం మరోసారి రాష్ట్ర పార్టీ నేతలతో అమిత్ షా సమావేశమయ్యే అవకాశాలు ఉన్నట్లు తెలుస్తోంది.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 6,
      slug: "tn-103",
      headline: "రేవంత్ రెడ్డి పాదయాత్రకు నన్ను పిలవలేదు..",
      category: "tn",
      img_url:
        "https://assets.thehansindia.com/h-upload/2020/08/27/994555-komati-reddy.webp",
      subjectsList: [
        "కాంగ్రెస్ సీనియర్ నాయకుడు, భువనగిరి ఎంపీ కోమటిరెడ్డి వెంకట్ రెడ్డి మరోసారి రేవంత్ రెడ్డిపై ఆసక్తికర వ్యాఖ్యలు చేశారు. రేవంత్ పాదయాత్రకు తనను పిలవలేదని ఆయన వెల్లడించారు. మార్చి 16 నుంచి సీఎల్పీ నాయకుడు మల్లు భట్టి విక్రమార్క పాదయాత్ర చేయబోతున్నారు. ఈ నేపథ్యంలో విక్రమార్కతో ఆదివారం హైదరాబాద్ లోని తన నివాసంలో ఆయన భేటీ అయ్యారు. ఈ సందర్భంగా కోమటిరెడ్డి మాట్లాడుతూ.. విక్రమార్క పాదయాత్రలో తాను కూడా పాల్గొనబోతున్నట్టు చెప్పారు.",
      ],
      headline_subject: "హైలైట్ TN",
    },
  ],
  trending: [
    {
      id: 1,
      slug: "ap-102",
      headline: "పులివెందులలో వైసీపీ కంటే టీడీపీకి ఎక్కువ ఓట్లు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98746813/98746813.jpg?imgsize=39548&width=540&height=405&resizemode=75",
      subjectsList: [
        "ఏపీ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల ఫలితాల్లో టీడీపీ రెండు స్థానాల్లో విజయం సాధించింది. తూర్పు రాయలసీమ స్థానం నుంచి కంచర్ల శ్రీకాంత్.. ఉత్తరాంధ్ర స్థానం నుంచి వేపాడ చిరంజీవిరావు గెలిచారు. ఇక మిగిలిన పశ్చిమ రాయలసీమ స్థానంలో హోరా హోరీగా కౌంటింగ్ సాగుతుండగా.. రెండో ప్రాధాన్యతా ఓట్ల లెక్కింపు జరుగుతోంది. దీంతో అందరి కళ్లు ఆ ఫలితం వైపు మళ్లింది.",
        `ఈ క్రమంలో పశ్చిమ రాయలసీమ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికలకు సంబంధించి ఓ ప్రచారం ఇప్పుడు వైరల్ అవుతోంది. ముఖ్యమంత్రి వైఎస్ జగన్ ప్రాతినిధ్యం వహిస్తున్న పులివెందుల నియోజకవర్గంలో అధికార వైఎస్సార్‌సీపీ అభ్యర్థి కంటే టీడీపీ అభ్యర్థికి ఎక్కువ ఓట్లు వచ్చాయని ప్రచారం జరుగుతోంది. `,
        `సోషల్ మీడియాలో పోస్టులు, ట్వీట్‌లు వైరల్ అవుతున్నాయి.. దీంతో ఏపీ ప్రభుత్వ ఫ్యాక్ట్‌ చెక్‌ విభాగం స్పందించింది. ఆ ప్రచారం వాస్తవం కాదని క్లారిటీ ఇచ్చింది. సోషల్‌ మీడియాలో జరుగుతున్న ఈ వాదన పూర్తిగా నిరాధారమని తేల్చి చెప్పింది.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 2,
      slug: "ap-103",
      headline: "ఎమ్మెల్సీ ఎన్నికల్లో గెలుపుతో గుడివాడలో సంబరాలు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98745698/98745698.jpg?imgsize=104986&width=700&height=525&resizemode=75",
      subjectsList: [
        "పీలో జరిగిన గ్రాడ్యుయేట్స్ ఎమ్మెల్సీ ఎన్నికల్లో టీడీపీ రెండుచోట్ల విజయం సాధించింది. ఈ సందర్భంగా రాష్ట్రవ్యాప్తంగా తెలుగు దేశం పార్టీ శ్రేణులు సంబరాలు చేసుకున్నారు. టపాసులు కాల్చి, స్వీట్లు పంచుకుని ఆనందాన్ని వ్యక్తం చేశారు. ఈ క్రమంలో గుడివాడలో కూడా తెలుగు తమ్ముళ్లు సంబరాలు జరిపారు.. ",
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 3,
      slug: "tn-103",
      headline: "రేవంత్ రెడ్డి పాదయాత్రకు నన్ను పిలవలేదు..",
      category: "tn",
      img_url: "https://img.ap7am.com/bimg/cr-20230312tn640da495b82ac.jpg",
      subjectsList: [
        "కాంగ్రెస్ సీనియర్ నాయకుడు, భువనగిరి ఎంపీ కోమటిరెడ్డి వెంకట్ రెడ్డి మరోసారి రేవంత్ రెడ్డిపై ఆసక్తికర వ్యాఖ్యలు చేశారు. రేవంత్ పాదయాత్రకు తనను పిలవలేదని ఆయన వెల్లడించారు. మార్చి 16 నుంచి సీఎల్పీ నాయకుడు మల్లు భట్టి విక్రమార్క పాదయాత్ర చేయబోతున్నారు. ఈ నేపథ్యంలో విక్రమార్కతో ఆదివారం హైదరాబాద్ లోని తన నివాసంలో ఆయన భేటీ అయ్యారు. ఈ సందర్భంగా కోమటిరెడ్డి మాట్లాడుతూ.. విక్రమార్క పాదయాత్రలో తాను కూడా పాల్గొనబోతున్నట్టు చెప్పారు.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 4,
      slug: "sprt-101",
      headline:
        "WTC ఫైనల్‌కు ముందు సెలెక్టర్‌లను ఆసక్తిగా ఉంచడంలో KL రాహుల్ చాలా బాగా చేసాడు: రవిశాస్త్రి",
      category: "sprt",
      img_url: "https://circleofcricket.com/post_image/post_image_64280ce.jpg",
      subjectsList: [
        `ముంబయి: జూన్‌లో అదే ప్రత్యర్థితో జరిగిన ప్రపంచ టెస్ట్ ఛాంపియన్‌షిప్ (డబ్ల్యుటిసి) ఫైనల్‌కు ముందు జాతీయ సెలక్టర్లను ఆసక్తిగా ఉంచడానికి ఆస్ట్రేలియాతో జరిగిన మొదటి వన్డేలో వికెట్ కీపర్-బ్యాటర్ కెఎల్ రాహుల్ బాగా రాణించాడని భారత మాజీ ప్రధాన కోచ్ రవిశాస్త్రి అభిప్రాయపడ్డాడు.`,
        `189 పరుగుల ఛేదనలో ఆస్ట్రేలియాను 188 పరుగులకు ఆలౌట్ చేయడంతో భారత్ 19.2 ఓవర్లలో 83/5 వద్ద అనిశ్చిత పరిస్థితిలో ఉంది. స్టీవ్ స్మిత్ యొక్క అద్భుతమైన డైవింగ్ క్యాచ్‌ని అందుకున్న రాహుల్, తన గ్లోవ్‌వర్క్‌తో చక్కటి పనిని చేశాడు, తర్వాత అజేయంగా 75 పరుగులు చేయడం ద్వారా ఒత్తిడికి లోనైన పరిస్థితిలో అడుగుపెట్టాడు.`,
      ],
      headline_subject: "Sports",
    },
    {
      id: 5,
      slug: "sprt-102",
      headline:
        "NZ vs SL, 2వ టెస్ట్ | విలియమ్సన్, నికోల్స్ డబుల్ సెంచరీలతో న్యూజిలాండ్‌ను అగ్రస్థానంలో నిలిపారు",
      category: "sprt",
      img_url:
        "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/yNlHeBnC4BE_DfVeecOKzallwXI=/800x0/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/32YPX6WJMJFBXX5GMPSB4LLONU.jpg",
      subjectsList: [
        `కేన్ విలియమ్సన్ మరియు హెన్రీ నికోల్స్ మూడో వికెట్‌కు 363 పరుగుల భాగస్వామ్యంలో డబుల్ సెంచరీలు చేయడంతో న్యూజిలాండ్ 580-4 పరుగులు చేసి శ్రీలంకతో రెండో క్రికెట్ టెస్ట్ రెండో రోజు శనివారం తన మొదటి ఇన్నింగ్స్‌ను డిక్లేర్ చేసింది.`,
        `విలియమ్సన్ తన ఆరవ డబుల్ సెంచరీని నమోదు చేశాడు మరియు 215 పరుగుల వద్ద అవుట్ అయ్యాడు మరియు నికోల్స్ న్యూజిలాండ్ కోసం అతని మొదటి మరియు అత్యధిక టెస్ట్ స్కోరును అందించాడు మరియు కెప్టెన్ టిమ్ సౌతీ డిక్లరేషన్‌ను ప్రకటించినప్పుడు 200 నాటౌట్‌గా ఉన్నాడు.`,
        `ఒక టెస్టులో ఒకే ఇన్నింగ్స్‌లో ఇద్దరు న్యూజిలాండ్ బ్యాట్స్‌మెన్ డబుల్ సెంచరీలు చేయడం ఇదే తొలిసారి.`,
      ],
      headline_subject: "sports",
    },
  ],
  main_page_sec_one: [
    {
      id: 1,
      slug: "ap-102",
      headline: "పులివెందులలో వైసీపీ కంటే టీడీపీకి ఎక్కువ ఓట్లు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98746813/98746813.jpg?imgsize=39548&width=540&height=405&resizemode=75",
      subjectsList: [
        "ఏపీ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల ఫలితాల్లో టీడీపీ రెండు స్థానాల్లో విజయం సాధించింది. తూర్పు రాయలసీమ స్థానం నుంచి కంచర్ల శ్రీకాంత్.. ఉత్తరాంధ్ర స్థానం నుంచి వేపాడ చిరంజీవిరావు గెలిచారు. ఇక మిగిలిన పశ్చిమ రాయలసీమ స్థానంలో హోరా హోరీగా కౌంటింగ్ సాగుతుండగా.. రెండో ప్రాధాన్యతా ఓట్ల లెక్కింపు జరుగుతోంది. దీంతో అందరి కళ్లు ఆ ఫలితం వైపు మళ్లింది.",
        `ఈ క్రమంలో పశ్చిమ రాయలసీమ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికలకు సంబంధించి ఓ ప్రచారం ఇప్పుడు వైరల్ అవుతోంది. ముఖ్యమంత్రి వైఎస్ జగన్ ప్రాతినిధ్యం వహిస్తున్న పులివెందుల నియోజకవర్గంలో అధికార వైఎస్సార్‌సీపీ అభ్యర్థి కంటే టీడీపీ అభ్యర్థికి ఎక్కువ ఓట్లు వచ్చాయని ప్రచారం జరుగుతోంది. `,
        `సోషల్ మీడియాలో పోస్టులు, ట్వీట్‌లు వైరల్ అవుతున్నాయి.. దీంతో ఏపీ ప్రభుత్వ ఫ్యాక్ట్‌ చెక్‌ విభాగం స్పందించింది. ఆ ప్రచారం వాస్తవం కాదని క్లారిటీ ఇచ్చింది. సోషల్‌ మీడియాలో జరుగుతున్న ఈ వాదన పూర్తిగా నిరాధారమని తేల్చి చెప్పింది.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 2,
      slug: "ap-103",
      headline: "ఎమ్మెల్సీ ఎన్నికల్లో గెలుపుతో గుడివాడలో సంబరాలు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98745698/98745698.jpg?imgsize=104986&width=700&height=525&resizemode=75",
      subjectsList: [
        "పీలో జరిగిన గ్రాడ్యుయేట్స్ ఎమ్మెల్సీ ఎన్నికల్లో టీడీపీ రెండుచోట్ల విజయం సాధించింది. ఈ సందర్భంగా రాష్ట్రవ్యాప్తంగా తెలుగు దేశం పార్టీ శ్రేణులు సంబరాలు చేసుకున్నారు. టపాసులు కాల్చి, స్వీట్లు పంచుకుని ఆనందాన్ని వ్యక్తం చేశారు. ఈ క్రమంలో గుడివాడలో కూడా తెలుగు తమ్ముళ్లు సంబరాలు జరిపారు.. ",
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 3,
      slug: "tn-103",
      headline: "రేవంత్ రెడ్డి పాదయాత్రకు నన్ను పిలవలేదు..",
      category: "tn",
      img_url: "https://img.ap7am.com/bimg/cr-20230312tn640da495b82ac.jpg",
      subjectsList: [
        "కాంగ్రెస్ సీనియర్ నాయకుడు, భువనగిరి ఎంపీ కోమటిరెడ్డి వెంకట్ రెడ్డి మరోసారి రేవంత్ రెడ్డిపై ఆసక్తికర వ్యాఖ్యలు చేశారు. రేవంత్ పాదయాత్రకు తనను పిలవలేదని ఆయన వెల్లడించారు. మార్చి 16 నుంచి సీఎల్పీ నాయకుడు మల్లు భట్టి విక్రమార్క పాదయాత్ర చేయబోతున్నారు. ఈ నేపథ్యంలో విక్రమార్కతో ఆదివారం హైదరాబాద్ లోని తన నివాసంలో ఆయన భేటీ అయ్యారు. ఈ సందర్భంగా కోమటిరెడ్డి మాట్లాడుతూ.. విక్రమార్క పాదయాత్రలో తాను కూడా పాల్గొనబోతున్నట్టు చెప్పారు.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 4,
      slug: "sprt-101",
      headline:
        "WTC ఫైనల్‌కు ముందు సెలెక్టర్‌లను ఆసక్తిగా ఉంచడంలో KL రాహుల్ చాలా బాగా చేసాడు: రవిశాస్త్రి",
      category: "sprt",
      img_url: "https://circleofcricket.com/post_image/post_image_64280ce.jpg",
      subjectsList: [
        `ముంబయి: జూన్‌లో అదే ప్రత్యర్థితో జరిగిన ప్రపంచ టెస్ట్ ఛాంపియన్‌షిప్ (డబ్ల్యుటిసి) ఫైనల్‌కు ముందు జాతీయ సెలక్టర్లను ఆసక్తిగా ఉంచడానికి ఆస్ట్రేలియాతో జరిగిన మొదటి వన్డేలో వికెట్ కీపర్-బ్యాటర్ కెఎల్ రాహుల్ బాగా రాణించాడని భారత మాజీ ప్రధాన కోచ్ రవిశాస్త్రి అభిప్రాయపడ్డాడు.`,
        `189 పరుగుల ఛేదనలో ఆస్ట్రేలియాను 188 పరుగులకు ఆలౌట్ చేయడంతో భారత్ 19.2 ఓవర్లలో 83/5 వద్ద అనిశ్చిత పరిస్థితిలో ఉంది. స్టీవ్ స్మిత్ యొక్క అద్భుతమైన డైవింగ్ క్యాచ్‌ని అందుకున్న రాహుల్, తన గ్లోవ్‌వర్క్‌తో చక్కటి పనిని చేశాడు, తర్వాత అజేయంగా 75 పరుగులు చేయడం ద్వారా ఒత్తిడికి లోనైన పరిస్థితిలో అడుగుపెట్టాడు.`,
      ],
      headline_subject: "Sports",
    },
    {
      id: 5,
      slug: "sprt-102",
      headline:
        "NZ vs SL, 2వ టెస్ట్ | విలియమ్సన్, నికోల్స్ డబుల్ సెంచరీలతో న్యూజిలాండ్‌ను అగ్రస్థానంలో నిలిపారు",
      category: "sprt",
      img_url:
        "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/yNlHeBnC4BE_DfVeecOKzallwXI=/800x0/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/32YPX6WJMJFBXX5GMPSB4LLONU.jpg",
      subjectsList: [
        `కేన్ విలియమ్సన్ మరియు హెన్రీ నికోల్స్ మూడో వికెట్‌కు 363 పరుగుల భాగస్వామ్యంలో డబుల్ సెంచరీలు చేయడంతో న్యూజిలాండ్ 580-4 పరుగులు చేసి శ్రీలంకతో రెండో క్రికెట్ టెస్ట్ రెండో రోజు శనివారం తన మొదటి ఇన్నింగ్స్‌ను డిక్లేర్ చేసింది.`,
        `విలియమ్సన్ తన ఆరవ డబుల్ సెంచరీని నమోదు చేశాడు మరియు 215 పరుగుల వద్ద అవుట్ అయ్యాడు మరియు నికోల్స్ న్యూజిలాండ్ కోసం అతని మొదటి మరియు అత్యధిక టెస్ట్ స్కోరును అందించాడు మరియు కెప్టెన్ టిమ్ సౌతీ డిక్లరేషన్‌ను ప్రకటించినప్పుడు 200 నాటౌట్‌గా ఉన్నాడు.`,
        `ఒక టెస్టులో ఒకే ఇన్నింగ్స్‌లో ఇద్దరు న్యూజిలాండ్ బ్యాట్స్‌మెన్ డబుల్ సెంచరీలు చేయడం ఇదే తొలిసారి.`,
      ],
      headline_subject: "sports",
    },
  ],
  main_page_sec_two: [
    {
      id: 1,
      slug: "ap-102",
      headline: "పులివెందులలో వైసీపీ కంటే టీడీపీకి ఎక్కువ ఓట్లు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98746813/98746813.jpg?imgsize=39548&width=540&height=405&resizemode=75",
      subjectsList: [
        "ఏపీ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికల ఫలితాల్లో టీడీపీ రెండు స్థానాల్లో విజయం సాధించింది. తూర్పు రాయలసీమ స్థానం నుంచి కంచర్ల శ్రీకాంత్.. ఉత్తరాంధ్ర స్థానం నుంచి వేపాడ చిరంజీవిరావు గెలిచారు. ఇక మిగిలిన పశ్చిమ రాయలసీమ స్థానంలో హోరా హోరీగా కౌంటింగ్ సాగుతుండగా.. రెండో ప్రాధాన్యతా ఓట్ల లెక్కింపు జరుగుతోంది. దీంతో అందరి కళ్లు ఆ ఫలితం వైపు మళ్లింది.",
        `ఈ క్రమంలో పశ్చిమ రాయలసీమ పట్టభద్రుల ఎమ్మెల్సీ ఎన్నికలకు సంబంధించి ఓ ప్రచారం ఇప్పుడు వైరల్ అవుతోంది. ముఖ్యమంత్రి వైఎస్ జగన్ ప్రాతినిధ్యం వహిస్తున్న పులివెందుల నియోజకవర్గంలో అధికార వైఎస్సార్‌సీపీ అభ్యర్థి కంటే టీడీపీ అభ్యర్థికి ఎక్కువ ఓట్లు వచ్చాయని ప్రచారం జరుగుతోంది. `,
        `సోషల్ మీడియాలో పోస్టులు, ట్వీట్‌లు వైరల్ అవుతున్నాయి.. దీంతో ఏపీ ప్రభుత్వ ఫ్యాక్ట్‌ చెక్‌ విభాగం స్పందించింది. ఆ ప్రచారం వాస్తవం కాదని క్లారిటీ ఇచ్చింది. సోషల్‌ మీడియాలో జరుగుతున్న ఈ వాదన పూర్తిగా నిరాధారమని తేల్చి చెప్పింది.`,
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 2,
      slug: "ap-103",
      headline: "ఎమ్మెల్సీ ఎన్నికల్లో గెలుపుతో గుడివాడలో సంబరాలు..",
      category: "ap",
      img_url:
        "https://telugu.samayam.com/thumb/98745698/98745698.jpg?imgsize=104986&width=700&height=525&resizemode=75",
      subjectsList: [
        "పీలో జరిగిన గ్రాడ్యుయేట్స్ ఎమ్మెల్సీ ఎన్నికల్లో టీడీపీ రెండుచోట్ల విజయం సాధించింది. ఈ సందర్భంగా రాష్ట్రవ్యాప్తంగా తెలుగు దేశం పార్టీ శ్రేణులు సంబరాలు చేసుకున్నారు. టపాసులు కాల్చి, స్వీట్లు పంచుకుని ఆనందాన్ని వ్యక్తం చేశారు. ఈ క్రమంలో గుడివాడలో కూడా తెలుగు తమ్ముళ్లు సంబరాలు జరిపారు.. ",
      ],
      headline_subject: "హైలైట్ AP",
    },
    {
      id: 3,
      slug: "tn-103",
      headline: "రేవంత్ రెడ్డి పాదయాత్రకు నన్ను పిలవలేదు..",
      category: "tn",
      img_url: "https://img.ap7am.com/bimg/cr-20230312tn640da495b82ac.jpg",
      subjectsList: [
        "కాంగ్రెస్ సీనియర్ నాయకుడు, భువనగిరి ఎంపీ కోమటిరెడ్డి వెంకట్ రెడ్డి మరోసారి రేవంత్ రెడ్డిపై ఆసక్తికర వ్యాఖ్యలు చేశారు. రేవంత్ పాదయాత్రకు తనను పిలవలేదని ఆయన వెల్లడించారు. మార్చి 16 నుంచి సీఎల్పీ నాయకుడు మల్లు భట్టి విక్రమార్క పాదయాత్ర చేయబోతున్నారు. ఈ నేపథ్యంలో విక్రమార్కతో ఆదివారం హైదరాబాద్ లోని తన నివాసంలో ఆయన భేటీ అయ్యారు. ఈ సందర్భంగా కోమటిరెడ్డి మాట్లాడుతూ.. విక్రమార్క పాదయాత్రలో తాను కూడా పాల్గొనబోతున్నట్టు చెప్పారు.",
      ],
      headline_subject: "హైలైట్ TN",
    },
    {
      id: 4,
      slug: "sprt-101",
      headline:
        "WTC ఫైనల్‌కు ముందు సెలెక్టర్‌లను ఆసక్తిగా ఉంచడంలో KL రాహుల్ చాలా బాగా చేసాడు: రవిశాస్త్రి",
      category: "sprt",
      img_url: "https://circleofcricket.com/post_image/post_image_64280ce.jpg",
      subjectsList: [
        `ముంబయి: జూన్‌లో అదే ప్రత్యర్థితో జరిగిన ప్రపంచ టెస్ట్ ఛాంపియన్‌షిప్ (డబ్ల్యుటిసి) ఫైనల్‌కు ముందు జాతీయ సెలక్టర్లను ఆసక్తిగా ఉంచడానికి ఆస్ట్రేలియాతో జరిగిన మొదటి వన్డేలో వికెట్ కీపర్-బ్యాటర్ కెఎల్ రాహుల్ బాగా రాణించాడని భారత మాజీ ప్రధాన కోచ్ రవిశాస్త్రి అభిప్రాయపడ్డాడు.`,
        `189 పరుగుల ఛేదనలో ఆస్ట్రేలియాను 188 పరుగులకు ఆలౌట్ చేయడంతో భారత్ 19.2 ఓవర్లలో 83/5 వద్ద అనిశ్చిత పరిస్థితిలో ఉంది. స్టీవ్ స్మిత్ యొక్క అద్భుతమైన డైవింగ్ క్యాచ్‌ని అందుకున్న రాహుల్, తన గ్లోవ్‌వర్క్‌తో చక్కటి పనిని చేశాడు, తర్వాత అజేయంగా 75 పరుగులు చేయడం ద్వారా ఒత్తిడికి లోనైన పరిస్థితిలో అడుగుపెట్టాడు.`,
      ],
      headline_subject: "Sports",
    },
    {
      id: 5,
      slug: "sprt-102",
      headline:
        "NZ vs SL, 2వ టెస్ట్ | విలియమ్సన్, నికోల్స్ డబుల్ సెంచరీలతో న్యూజిలాండ్‌ను అగ్రస్థానంలో నిలిపారు",
      category: "sprt",
      img_url:
        "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/yNlHeBnC4BE_DfVeecOKzallwXI=/800x0/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/32YPX6WJMJFBXX5GMPSB4LLONU.jpg",
      subjectsList: [
        `కేన్ విలియమ్సన్ మరియు హెన్రీ నికోల్స్ మూడో వికెట్‌కు 363 పరుగుల భాగస్వామ్యంలో డబుల్ సెంచరీలు చేయడంతో న్యూజిలాండ్ 580-4 పరుగులు చేసి శ్రీలంకతో రెండో క్రికెట్ టెస్ట్ రెండో రోజు శనివారం తన మొదటి ఇన్నింగ్స్‌ను డిక్లేర్ చేసింది.`,
        `విలియమ్సన్ తన ఆరవ డబుల్ సెంచరీని నమోదు చేశాడు మరియు 215 పరుగుల వద్ద అవుట్ అయ్యాడు మరియు నికోల్స్ న్యూజిలాండ్ కోసం అతని మొదటి మరియు అత్యధిక టెస్ట్ స్కోరును అందించాడు మరియు కెప్టెన్ టిమ్ సౌతీ డిక్లరేషన్‌ను ప్రకటించినప్పుడు 200 నాటౌట్‌గా ఉన్నాడు.`,
        `ఒక టెస్టులో ఒకే ఇన్నింగ్స్‌లో ఇద్దరు న్యూజిలాండ్ బ్యాట్స్‌మెన్ డబుల్ సెంచరీలు చేయడం ఇదే తొలిసారి.`,
      ],
      headline_subject: "sports",
    },
  ] 
};


export default newsData;